[
  {
    "MAIN_CONTENT": "<p>Elasticsearch - being an integral part of the Elastic Stack - is known for its full-text search and analytics ability.<br />\r\n<br />\r\nElasticsearch is running on tens of thousands of nodes world-wide, so despite all the functionality squeezed into new releases, we also have to think about security, all the time. This talk will cover different aspects of Elasticsearch, explain some features and (sometimes unpopular) decisions and the reasoning behind. This talk will cover:</p>\r\n\r\n<ul>\r\n\t<li>Usage of the Java Security Manager including integration with plugins</li>\r\n\t<li>Production vs. Development mode</li>\r\n\t<li>System Call Filtering</li>\r\n\t<li>Our own scripting language called Painless, which superseded all other scripting languages like MVEL, Groovy or Javascript</li>\r\n\t<li>X-Pack security features</li>\r\n</ul>\r\n\r\n<p>The goal of this talk is not (only) to show off Elasticsearch features. You start thinking about these non-functional requirements in your own applications as well!</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "jvm-security-manager",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 1,
    "TEASER": "The JVM Security Manager - a much underappreciated feature of the JVM",
    "ID": "19D86757-C387-4746-A94554381751691D",
    "DATEFROM": "",
    "TITLE": "JVM Security Manager",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>ORM stands for Object Relational Mapper. In applications, objects know about each other through references in memory. In a relational database, tables of data refer to each other through primary and foreign key relationships. An ORM translates objects relational data into objects while the developer doesn&rsquo;t have to do any of the hard work, so ORM should be a real time-saver.</p>\r\n\r\n<p>In this presentation we will see if this promise holds true, based on our own experiences with a fairly complex customer portal project started &gt; 10 years ago. We will show the basics of Coldfusion ORM, show some of the complexities we encountered when we started, from Transfer ORM in CF8, via CF ORM and custom SQL in CF9.0, CF ORM only in CF9.01 and the limitations of Hibernate ORM in Lucee 4 and 5. We will show some tools which could help increase your ORM Love such as the Coldbox ORM module and an alternative approach to ORM with Quick ORM. If you really can&rsquo;t stop hating ORM there are still other options to make database interactions easier, such as query and scheme builders in qb and database migrations with cfmigrations.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "orm-love-and-hate",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 2,
    "TEASER": "There are people who love ORM and people who hate it. After this session you can decide what you do - Maybe you stop hating it.",
    "ID": "91FDF2AA-AA62-43BD-96DED19FEBC01A69",
    "DATEFROM": "",
    "TITLE": "ORM Love and Hate",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "Regulation (EU) 2016/679 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data (better known as &ldquo;GDPR&rdquo;) has been around like forever. At least for legal and IT professionals.<br />\r\n<br />\r\nThis Regulation has been seen as a data protection matter, but GDPR is not about protecting data. GDPR is all about protecting humans from undue negative effect that may result from the processing of information about (or relating to) them.<br />\r\n<br />\r\nAnd because privacy by design and privacy by default are at the heart of our privacy protection, and IT is at the heart of it, programmers, developers and network managers are underestimated human rights professionals.<br />\r\n<br />\r\nYes. You read right. IT professionals are human rights specialists. And we will spend this session trying to get through what we, people, expect from you to protect our privacy.<br />\r\n<br />\r\nWe will also browse through what GDPR has put in place to help and enforce you to make things right when it comes to processing humans&rsquo; personal data.",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "i-do-cfml-java-php-and-human-rights",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 3,
    "TEASER": "Regulation (EU) 2016/679 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data (better known as “GDPR”) has been around like forever. At least for legal and IT professionals. This Regulation has been seen as a data protection matter, but GDPR is not about protecting data. GDPR is all about protecting humans from undue negative effect that may result from the processing of information about (or relating to) them.",
    "ID": "BEA0BC0A-3F38-41B1-84745134316140A7",
    "DATEFROM": "",
    "TITLE": "I do CFML, java, PHP and… human rights!",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Google has this reasonably new thing: &ldquo;Flutter is Google&rsquo;s mobile app SDK for crafting high-quality native interfaces on iOS and Android in record time. Flutter works with existing code, is used by developers and organizations around the world, and is free and open source.&rdquo;</p>\r\n\r\n<p>Ooooooookay. So&hellip; what is Flutter then? It&rsquo;s not native and it&rsquo;s not HTML and Javascript in a WebView either. Is it something like Google&rsquo;s answer to ReactNative? The talk will answer this and many other questions. We will have a look at how to use Flutter and demonstrate how fast it can be to create an app using the technology. We will build a simple (but significantly more complex than Hello World) app and look at concepts like user management, database and API connections and various communication features. Flutter&rsquo;s concept of UI widgets will be introduced and we&rsquo;ll have a good look at Dart, Flutter&rsquo;s language, and what differentiates it from other common mobile languages used in mobile technologies such as Java, Swift and Kotlin.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "flutter-the-next-generation-app-development",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 4,
    "TEASER": "Google has this reasonably new thing: “Flutter is Google’s mobile app SDK for crafting high-quality native interfaces on iOS and Android in record time. Flutter works with existing code, is used by developers and organizations around the world, and is free and open source.”",
    "ID": "FD3D6BBA-D88E-40F3-A0D2E9AF6F469D95",
    "DATEFROM": "",
    "TITLE": "Flutter - the next generation of cross-plattform app development",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>The latest in cool is using containers and Docker! In this session I shall show you how we containerise our applications at CMD and how this has helped our clients.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "going-live-with-commandbox-and-docker",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 5,
    "TEASER": "The latest in cool is using containers and Docker! In this session I shall show you how we containerise our applications at CMD and how this has helped our clients.",
    "ID": "7FDCE4CC-A681-48C7-B095E94E41D177E1",
    "DATEFROM": "",
    "TITLE": "Going live with Commandbox and Docker!",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>In this session we will cover how to build an API using ColdBox, but with the added benefit of using cffractal, an incredible ColdBox module that helps you iterate over collections of data or return single structural information.</p>\r\n\r\n<p>During the session we will build an API from the ground up, install cffractal and see how much simpler it is to manipulate data, alter the responses using customer transformers, and add meta information to you API endpoints.</p>\r\n\r\n<p>API development has never been so much fun.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "building-an-api-with-cffractal-and-coldbox",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 7,
    "TEASER": "In this session we will cover how to build an API using ColdBox, but with the added benefit of using cffractal, an incredible ColdBox module that helps you iterate over collections of data or return single structural information.",
    "ID": "84168A3B-BF91-4B71-BB50B85A9B6F4E2D",
    "DATEFROM": "",
    "TITLE": "Building an API with cffractal and coldbox ",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "Description will follow",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "websockets-from-scratch",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 8,
    "TEASER": "Description will follow",
    "ID": "863879EB-7132-42AF-809A61FE9C8B33A6",
    "DATEFROM": "",
    "TITLE": "WebSockets from scratch ",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>This session will be an introduction to the Amazon Elastic Container Service (ECS) and its associated services and how it all slots together to give you a world-class platform for continuous integration (CI) and deployment.</p>\r\n\r\n<p>Amazon ECS is a high-performance and highly scalable container orchestration service for Docker containers and allows you to run and scale containerized applications on the AWS platform. It eliminates the need for you to install and operate your own container orchestration software, manage and scale a cluster of virtual machines, or schedule containers on those virtual machines.</p>\r\n\r\n<p>When used in conjunction with other AWS services you can create an automated CI and deployment system allowing you to build, test and deploy code without any manual intervention required.</p>\r\n\r\n<p>In this session you will learn about:</p>\r\n\r\n<ul>\r\n\t<li>Elastic Container Service (ECS)</li>\r\n\t<li>CodePipeline</li>\r\n\t<li>CodeCommit</li>\r\n\t<li>CodeBuild</li>\r\n\t<li>Secrets Manager</li>\r\n\t<li>Application Load Balancer</li>\r\n\t<li>Certificate Manager</li>\r\n</ul>\r\n\r\n<p>This session will not be an introduction to AWS or Docker and some previous basic knowledge of both will be assumed, e.g. what AWS is, what an EC2 instance is, what Docker is, etc...</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "amazon-elastic-container-service-ecs",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 9,
    "TEASER": "An introduction to the Amazon Elastic Container Service (ECS) and its associated services and how it all slots together to give you a world-class platform for continuous integration (CI) and deployment. ",
    "ID": "BED5C1FF-B810-48DC-992A647C1764F337",
    "DATEFROM": "",
    "TITLE": "Amazon Elastic Container Service (ECS)",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>This year, Intergral, the company behind FusionReactor are celebrating 20 years in business and to commemorate this and say a big &ldquo;thank you&rdquo; to the CF community who supported us along the way, each attendee at this year&rsquo;s presentation will receive a complimentary FusionReactor Developer Edition license (value &euro;179) &ndash; so you can experience the full benefits of FusionReactor during development and testing.</p>\r\n\r\n<p>In this session, veteran CF trouble shooter Charlie Arehart will team-up with Intergral CEO David Tattersall,&nbsp; to demonstrate how FusionReactor has enabled 1000&rsquo;s of companies to get to the root of the most elusive defects and performance issues, and keep applications resilient.&nbsp; You&#39;ll see why it&rsquo;s the ONLY monitoring solution which can be effectively used across the whole Software Development Life Cycle &ndash; from dev to test to stage to production.</p>\r\n\r\n<p>Charlie and David will be showing off such things as&hellip;</p>\r\n\r\n<ul>\r\n\t<li>Archived Metrics (graphically view log data across restarts and for days/weeks back)</li>\r\n\t<li>Thread Visualizer / CPU Sampler (spot CPU and other problems you might otherwise miss)</li>\r\n\t<li>Automatic display/decompile CFML code from within FR (in stack traces, thread dumps, and profiles)</li>\r\n\t<li>New CF tag instrumentation (CFFTP,&nbsp; CFMAIL,&nbsp; CFPOP,&nbsp; CFIMAP, CFLDAP)</li>\r\n\t<li>Support to track the new async operation in CF 2018</li>\r\n\t<li>FusionReactor Cloud, many new features</li>\r\n</ul>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "why-fr-is-the-1-monitoring-solution-for-cf",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 10,
    "TEASER": "",
    "ID": "7F447DE5-F88D-4458-AC58AC52BBA91A89",
    "DATEFROM": "",
    "TITLE": "See why FusionReactor is the #1 monitoring solution for CF - then go find out for yourself with a complimentary FR license!",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>You probably already know that your CFML code is compiled into Java classes and runs inside a Java Virtual Machine.&nbsp; In this talk we will cover what that means, how it works, and how you can use it to your benefit, to fine tune your application&#39;s performance, write more performant code for those places where every microsecond counts, or develop applications faster by utilizing one of the many available FOSS Java libraries.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "cfml-is-java",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 11,
    "TEASER": "You probably already know that your CFML code is compiled into Java classes and runs inside a Java Virtual Machine.  In this talk we will cover what that means, how it works, and how you can use it to your benefit, to fine tune your application's performance, write more performant code for those places where every microsecond counts, or develop applications faster by utilizing one of the many available FOSS Java libraries.",
    "ID": "BC5DE686-4638-447C-8CF649665A7139BB",
    "DATEFROM": "",
    "TITLE": "CFML is Java",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Dependency Injection is a very common pattern used in modern web development. It&#39;s not specific to Java or ColdFusion or JavaScript...but it&#39;s equally awesome in all of those! And in other languages too! We&#39;ll look at some of the problems that Dependency Injection helps to solve; we&#39;ll look at some related concepts such as &quot;aspect oriented programming&quot; (AOP), and inversion of control (IOC); and show you how adding a DI framework to your app might be just the magic your app needs!</p>\r\n\r\n<p>Target Audience: People that want to know what Dependency Injection is and when/why I should use it. You&#39;ve heard other terms like &quot;inversion of control&quot; and &quot;aspect oriented programming&quot; thrown around and aren&#39;t sure what they mean. Maybe you&#39;re a FW/1 user and want to know why everyone is excited that the new version of FW/1 will include DI/1. Or you just want to know what ColdSpring does -- we&#39;ll cover that too. (This talk will not be ColdFusion specific. Java and JavaScript programmers will equally benefit from the content.)<br />\r\n<br />\r\nAssumed Knowledge: For this talk we&#39;ll assume you are pretty familiar with classes and objects (in whatever language you prefer...JavaScript, ColdFusion, etc). You&#39;ve built a variety of classes/objects in some of your projects, and are familiar with OO concepts such as inheritance and composition.<br />\r\n<br />\r\nMain Points:</p>\r\n\r\n<ul>\r\n\t<li>What is Dependency Injection?</li>\r\n\t<li>When / why would I use this in my projects?</li>\r\n\t<li>Intro to Aspect-Oriented Programming (or AOP).</li>\r\n\t<li>Intro to Inversion of Control (IOC).</li>\r\n\t<li>What is &quot;Bean Management&quot;</li>\r\n\t<li>Code samples in a variety of languages showing when it might be useful to add some DI magic into your application.</li>\r\n</ul>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "dependency-injection",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 12,
    "TEASER": "Dependency Injection is a very common pattern used in modern web development. It's not specific to Java or ColdFusion or JavaScript...but it's equally awesome in all of those! And in other languages too! We'll look at some of the problems that Dependency Injection helps to solve; we'll look at some related concepts such as \"aspect oriented programming\" (AOP), and inversion of control (IOC); and show you how adding a DI framework to your app might be just the magic your app needs!",
    "ID": "3A58E0C7-D3C5-4E8B-A0E7A2E9170CF8B8",
    "DATEFROM": "",
    "TITLE": "Dependency Injection, why is it awesome and why should I care?",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>AngularJS is an extremely popular JavaScript framework for building client-side applications. Angular contains lots of great features and can be used to build both web and mobile applications. Then comes the server part. How do we send data from the Angular app to a server in the cloud? That&rsquo;s were our ColdFusion code comes into play. In this session we&rsquo;ll discuss how to get started with AngularJS and how to start building a simple JSON API using ColdFusion. Then we&rsquo;ll connect the 2 pieces together building a fully working application with AngularJS + ColdFusion.<br />\r\n<br />\r\nMain takeaways:</p>\r\n\r\n<ul>\r\n\t<li>Installing AngularJS and building your first Angular app</li>\r\n\t<li>Basic structure of an Angular application</li>\r\n\t<li>Building views and navigation</li>\r\n\t<li>Adding a service layer to Angular</li>\r\n\t<li>A brief intro to JSON, REST and API&rsquo;s</li>\r\n\t<li>Using ColdFusion to build a JSON API</li>\r\n\t<li>Connecting a ColdFusion API to an AngularJS application</li>\r\n\t<li>Some best practices</li>\r\n\t<li>Other resources</li>\r\n</ul>\r\n\r\n<p><br />\r\nTarget audience:<br />\r\n<br />\r\nColdFusion programmers that are new nor mostly new to AngularJS are encouraged to attend. Developers looking to start using ColdBox and those still stuck maintaining a legacy CF-include based application will all learn ways to connect their CFML codebase to an AngularJS front end application.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "angularjs-coldfusion",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 13,
    "TEASER": "AngularJS is an extremely popular JavaScript framework for building client-side applications. Angular contains lots of great features and can be used to build both web and mobile applications. Then comes the server part. How do we send data from the Angular app to a server in the cloud? That’s were our ColdFusion code comes into play.",
    "ID": "EF56E698-7477-4B9A-B285437B60A0B8BC",
    "DATEFROM": "",
    "TITLE": "AngularJS + ColdFusion",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "{{image:%7B%22asset%22%3A%22F5792EBC-616B-4B3F-A1C17CB002AE3267%22%2C%22alt_text%22%3A%22%22%2C%22alignment%22%3A%22auto%22%2C%22derivative%22%3A%22logo200%22%2C%22dimensions%22%3A%222480x827%22%2C%22quality%22%3A%22highestPerformance%22%2C%22spacing_top%22%3A%225%22%2C%22spacing_right%22%3A%225%22%2C%22spacing_bottom%22%3A%225%22%2C%22spacing_left%22%3A%225%22%2C%22copyright%22%3A%22%22%2C%22caption%22%3A%22%22%2C%22link%22%3A%22%22%2C%22link_asset%22%3A%22%22%2C%22link_page%22%3A%22%22%2C%22link_target%22%3A%22_self%22%7D:image}}\r\n<p>In diesem Vortrag gehen wir auf die aktuellen Bedrohungslagen und Ph&auml;nomene im Bereich Cybercrime ein, geben Einblick in die m&ouml;gliche Vorgehensweise des T&auml;ters und zeigen auf, welche Schutzmechanismen wirksam sind.</p>\r\n\r\n<p><strong>Hinweis:</strong> Dieser Vortrag wird auf deutsch gehalten</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><u>English version:</u></p>\r\n\r\n<p><span id=\"result_box\" lang=\"en\"><span>In this session, we will talk about current threats and cybercrime phenomena, give insight into the possible course of action of the perpetrator, and highlight which safeguards are in place.</span></span></p>\r\n\r\n<p><strong>Please note:</strong>&nbsp;<span id=\"result_box\" lang=\"en\"><span>This session is held in german, but is no less interesting</span></span></p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "cybercrime",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 14,
    "TEASER": "In diesem Vortrag gehen wir auf die aktuellen Bedrohungslagen und Phänomene im Bereich Cybercrime ein, geben Einblick in die mögliche Vorgehensweise des Täters und zeigen auf, welche Schutzmechanismen wirksam sind.",
    "ID": "224CA08E-53B0-4A3D-B30CF8990DFB1D64",
    "DATEFROM": "",
    "TITLE": "Cybercrime",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Preside is an incredibly powerful application development platform. Yes, it can be used to build websites and has awesome CMS capabilities, but these are just a subset of its features and can be completely turned off.</p>\r\n\r\n<p>Here at Pixl8, we have used Preside to build internal management systems, CRM systems, Server management tools, HR systems, Inventory management systems and more. Come along and learn how this Open Source, CFML platform can help give your team super powers!</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "preside-platform",
    "MAIN_IMAGE": "ACD5FF4B-5FD6-452B-B41756D245A665A3",
    "SORT_ORDER": 15,
    "TEASER": "Preside is an incredibly powerful application development platform. Yes, it can be used to build websites and has awesome CMS capabilities, but these are just a subset of its features and can be completely turned off.",
    "ID": "74D3DA95-5AB6-4092-B044A760BBD011E7",
    "DATEFROM": "",
    "TITLE": "Preside platform (Open Source Digital experience management & competing with Salesforce & MS Dynamics)",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>It&#39;s that time again: another new version of CF has come out (CF2018), and it&#39;s time for veteran CF troubleshooter and presenter Charlie Arehart to continue his tradition of identifying &quot;hidden gems&quot; in the new release, as he&#39;s been doing since CF4.</p>\r\n\r\n<p>Sure, most people can name a few of the big, new features in each release, while others will lament &quot;there&#39;s not much new&quot;, when in fact there is!</p>\r\n\r\n<p>Just as in every release of CF, there are always lots of things that go unheralded and which may be just what you&#39;ve been waiting for or that may delight you, whether solving a long-standing problem for you or providing a new technique, and whether related to coding, troubleshooting, administration, enterprise integration, and more.</p>\r\n\r\n<p>Charlie will also help identify edition differences, pricing, migration issues, etc., and as always where to find out more.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "cf2018-hidden-gems",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 16,
    "TEASER": "It's that time again: another new version of CF has come out (CF2018), and it's time for veteran CF troubleshooter and presenter Charlie Arehart to continue his tradition of identifying \"hidden gems\" in the new release, as he's been doing since CF4. ",
    "ID": "48826733-DD0B-492C-B6FDB4782D07E566",
    "DATEFROM": "",
    "TITLE": "CF2018 - Hidden gems",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Welcome to the wonderful world of Java Streams ported for the CFML world!</p>\r\n\r\n<p>The whole idea of streams is to enable functional-style operations on streams of elements. A stream is an abstraction, it&rsquo;s not a data structure. It&rsquo;s not a collection where you can store elements. The most important difference between a stream and a structure is that a stream doesn&rsquo;t hold the data. For example you cannot point to a location in the stream where a certain element exists. You can only specify the functions that operate on that data. A stream is an abstraction of a non-mutable collection of functions applied in some order to the data.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "cbstreams",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 17,
    "TEASER": "The whole idea of streams is to enable functional-style operations on streams of elements. A stream is an abstraction, it’s not a data structure. It’s not a collection where you can store elements.",
    "ID": "A182AF8A-1784-400E-9EC890A5802C25F8",
    "DATEFROM": "",
    "TITLE": "cbStreams : come accelerate your functional programming with Java streams in CFML",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "rulebox",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 18,
    "TEASER": "",
    "ID": "0AD31045-65CE-4A36-9D13D17639DCC86A",
    "DATEFROM": "",
    "TITLE": "RuleBox : A modern and natural Language rule engine for CFML",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>The new Adobe ColdFusion 2018 version has a lot new functions that make your work more efficient and comfortable.</p>\r\n\r\n<p>Functions like the new REST-Playground or the Asynchrone programming help you creating new ideas. The new Server-Monitor and the Code-Profiler help you optimizing your code and show you problems with your server immediately.</p>\r\n\r\n<p>Presented by Adobe itself.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "adobe-coldfusion-2018",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 19,
    "TEASER": "The new Adobe ColdFusion 2018 version has a lot new functions that make your work more efficient and comfortable. See how the new stuff works for you",
    "ID": "70C5B8DA-BB7F-47D8-A2F5A6856C76BF40",
    "DATEFROM": "",
    "TITLE": "Adobe ColdFusion 2018",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Updated Speed comparisons Lucee 4.5, Lucee 5.2, ACF 2016 &amp; ACF 2018</p>\r\n\r\n<p>What is fast and what is not fast coding wise</p>\r\n\r\n<p>At the first CFCamp I presented a speed comparison between the then current Versions of Railo and ACF. It was the dinner presentation since it went for quite a while and I have to admit, that due to that presentation, the planned party had to be cancelled.</p>\r\n\r\n<p>This presentation now has been:</p>\r\n\r\n<p>1. Updated to the latest versions of ACF and Lucee and</p>\r\n\r\n<p>2. Extended with new data and comparisons.</p>\r\n\r\n<p>You will learn, what is fast and what not in Lucee and/or ACF, and what one can do in order to prevent slow websites due to your slow code. This is an a/b testing with as much basic information as possible.</p>\r\n\r\n<p>In addition we will have a look at the latest version of the Rasia Tool ArgusCache and how it can help you improve the performance of your system.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "performance",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 20,
    "TEASER": "Of course you can buy bigger machines, more RAM and faster network connections. But there's a simpler and cheaper way: write performant code!\r\nWhat is fast and what is not fast coding wise - see it here.",
    "ID": "B1C3A5D2-C1E5-41F9-85A8C515D7C2C5F3",
    "DATEFROM": "",
    "TITLE": "High Performance CFML",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Security is getting more and more important. A 2-factor authentication will help you securing your logins.</p>\r\n\r\n<p>In this Session Rob shows you how to implement a 2-factor authentication for your own website. Learn about the different protocols FIDO U2F, Yubico OTP,&nbsp; Challenge-Response, etc.</p>\r\n\r\n<p>See how you can use your personal YubiKey for your own website.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3>Your personal YubiKey 4</h3>\r\n\r\n<p>Every attendee gets his own YubiKey 4 (worth $40) to use for his own purpose. Use it to authenticate yourself against services and websites like Gitlab, Dropbox, Google, Facebook, etc.</p>\r\n\r\n<p>But what is much more interesting: Use it for your own websites and applications. Rob will show you how to do it.</p>\r\n{{image:%7B%22asset%22%3A%2255FBD4F6-63D4-42B7-BCC36B947981425F%22%2C%22alt_text%22%3A%22%22%2C%22alignment%22%3A%22auto%22%2C%22derivative%22%3A%22logo200%22%2C%22dimensions%22%3A%221000x1000%22%2C%22quality%22%3A%22highestPerformance%22%2C%22spacing_top%22%3A%225%22%2C%22spacing_right%22%3A%225%22%2C%22spacing_bottom%22%3A%225%22%2C%22spacing_left%22%3A%225%22%2C%22copyright%22%3A%22%22%2C%22caption%22%3A%22%22%2C%22link%22%3A%22%22%2C%22link_asset%22%3A%22%22%2C%22link_page%22%3A%22%22%2C%22link_target%22%3A%22_self%22%7D:image}}\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "2-factor-authentication-for-your-own-website",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 21,
    "TEASER": "Security is getting more and more important. A 2-factor authentication will help you securing your logins. See here how you can integrate a 2FA by yourself with your YubiKey.",
    "ID": "ED4F3D64-1184-43FC-8238E1DBA7B1D349",
    "DATEFROM": "",
    "TITLE": "create a 2-factor authentication for your own website",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Right before CFCamp Lucee 5.3 will be released which holds many new features and improvements. Let&rsquo;s have a look what the Lucee developers have in stock for us in the released version and what is planned for the future versions.</p>\r\n\r\n<p>Is there a version 6.x on the horizon? What could we hope for? What should we pray for, what can we do in order to make it happen?</p>\r\n\r\n<p>Micha and Gert will present the latest and greatest of Lucee CFML and discuss with you the future of Lucee and LAS.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "lucee",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 22,
    "TEASER": "",
    "ID": "96CFDDDB-46EF-4AEA-890264B5A6498DCF",
    "DATEFROM": "",
    "TITLE": "Lucee 5.3 and beyond",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>During this session we will introduce you into the wonderful world of Customer Data Platforms and how you can integrate this into your own (maybe Lucee based)&nbsp; applications. Be able to target your visitors individually with the right content, integrate with external applications for data activation and transform your often anonymous visitors into known individuals.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "building-a-customer-data-platform",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 23,
    "TEASER": "During this session we will introduce you into the wonderful world of Customer Data Platforms and how you can integrate this into your own (maybe Lucee based)  applications. Be able to target your visitors individually with the right content, integrate with external applications for data activation and transform your often anonymous visitors into known individuals.",
    "ID": "AC76ED03-F1FB-43F1-8B75680CA56A5E0C",
    "DATEFROM": "",
    "TITLE": "Building a Customer Data Platform using Lucee & Piwik PRO",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Command line tools are all around us.&nbsp; We use them to interact with Git, Docker, Vagrant, or Angular. Many of these tools are written in Node, Python, or even Ruby, but did you know you can write your own command line tools directly with CFML?&nbsp;</p>\r\n\r\n<p>CFML is easier to develop in, contains more out-of-the-box features, and is (probably) more familiar to you.&nbsp;</p>\r\n\r\n<p>We&rsquo;ll take a look at the power of CommandBox Task Runners and custom commands for portable scripts that run the same on Windows, Mac or Linux and bring the power of Database calls, PDF generation, file system manipulation from the CLI using the familiar language of CFML with no web servers involved.&nbsp;</p>\r\n\r\n<p>We&rsquo;ll also review a handful of existing CLI tools already written such as CFConfig, Codechecker CLI, CFMigrations, and CFWheels CLI.&nbsp; You can distribute these tools amongst your developer team, or place them on ForgeBox.io as turn-key CLI tools for anyone in the world to use.&nbsp; Expect to get excited about new and modern ways to use CFML outside of the web paradigm!</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "command-line-tooling-via-cfml",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 24,
    "TEASER": "Command line tools are all around us.  We use them to interact with Git, Docker, Vagrant, or Angular. Many of these tools are written in Node, Python, or even Ruby, but did you know you can write your own command line tools directly with CFML? ",
    "ID": "748D3851-C207-4C75-AB5514DCA6640542",
    "DATEFROM": "",
    "TITLE": "Command Line Tooling via CFML",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Since the European General Data Protection Regulation took effect in May web developers had to face a lot of pratical problems to fulfill the new regulation. Especially the legally integration of common Social Media PlugIns is a challenging effort.</p>\r\n\r\n<p>The&nbsp;code snippets and APIs provided by the social networks demand personal data from all page visitors. Sharing this personal data without the user&acute;s consent is not longer allowed by the Data protection rules of the GDPR. As a result of the lac of transparency by the Social Media Platforms it is not possible for website owners to get the consent of the users in a proper way.</p>\r\n\r\n<p>Meanwhile solutions like Shariff or Embetty were developed to display remote content like tweets or videos without compromising the user&acute;s privacy. But none of these common solutions were useable for CF. That&acute;s why Bokowsky + Laymann developed an own framework for this purpose. In this talk Tom Ladek and Markus Laymann present the technical and legal problems of this project and the way they were solved.</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "gdpr-concerns-of-a-webdev",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 25,
    "TEASER": "Since the European General Data Protection Regulation took effect in May web developers had to face a lot of pratical problems to fulfill the new regulation. Especially the legally integration of common Social Media PlugIns is a challenging effort. Common solutions are not really useable for CF. That´s why Bokowsky + Laymann developed an own framework for this purpose.",
    "ID": "1129FF16-D230-4C6E-BAEFB4EE1B855500",
    "DATEFROM": "",
    "TITLE": "GDPR: concerns of a WebDev",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>The Yubikey is the perfect solution for you to authenticate against services and websites. See what els you can do wiht the Yubikey and how it helps you extending your security.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "the-yubikey",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 26,
    "TEASER": "The Yubikey is the perfect solution for you to authenticate against services and websites. See what els you can do wiht the Yubikey and how it helps you extending your security.",
    "ID": "E7B40B28-F4A8-4434-A47F9BFE2B9FF787",
    "DATEFROM": "",
    "TITLE": "The Yubikey",
    "SPEAKERS": ""
  },
  {
    "MAIN_CONTENT": "<p>Many people have a legacy codebase they would like to modernize but don&#39;t know where to start.&nbsp; The good news is you can make this transition slowly and at your own pace by embedding the new with the old. ColdBox&#39;s conventions are simple and easy to learn so you can convert the basics at first and implement more complex features down the road. We&#39;ll cover several methods of integrating ColdBox MVC into a legacy application and have demos of each to get you started.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "DURATION": "",
    "DATETO": "",
    "SLUG": "integrating-mvc-into-legacy",
    "MAIN_IMAGE": "",
    "SORT_ORDER": 27,
    "TEASER": "Many people have a legacy codebase they would like to modernize but don't know where to start.  The good news is you can make this transition slowly and at your own pace by embedding the new with the old. ColdBox's conventions are simple and easy to learn so you can convert the basics at first and implement more complex features down the road. We'll cover several methods of integrating ColdBox MVC into a legacy application and have demos of each to get you started.",
    "ID": "DEB05AC3-823E-423D-908797428AAD104A",
    "DATEFROM": "",
    "TITLE": "Integrating MVC into legacy",
    "SPEAKERS": ""
  }
]