{
  "blog" : { },
  "gallery" : [
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_4185.jpg?alt=media&token=ff3fd161-3d68-401a-90cd-74b90bd2a4d8",
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_4411.jpg?alt=media&token=7fda0d66-a631-4816-bd85-b93ef49ed3a6",
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_4577.jpg?alt=media&token=f14205b5-be75-447c-8bca-73a15ca2df41",
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_4525.jpg?alt=media&token=0428f0e3-fda0-4119-8249-69f98e936ce5",
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_4611.jpg?alt=media&token=b080143c-161c-4d9f-96f3-ebb6bdcdfd95",
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_4720.jpg?alt=media&token=75de0c2d-8bd9-48bb-9117-1349c9bc381f",
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_4646.jpg?alt=media&token=eafb0320-6f21-47bc-8ba4-8eec708f2076",
    "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fgallery%2Fimg_5294.jpg?alt=media&token=72ab5141-d21b-4e71-a58b-faa2b00d1d02"
  ],
  "notifications" : {
    "config" : {
      "icon" : "",
      "timezone" : "+03:00"
    },
    "messages" : { },
    "subscribers" : { },
    "test" : { },
    "users" : { }
  },
  "partners": [
    {
      "order" : 0,
      "title": "Made DACHFest possible!",
      "logos": [
        {
          "order" : 0,
          "logoUrl": "../images/logos/google.svg",
          "name": "Google",
          "url": "https://www.google.com/intl/en/about/"
        }
      ]
    },
    {
      "order" : 1,
      "title": "Diamond",
      "logos": [
        {
          "order" : 0,
          "logoUrl": "../images/logos/airbus.svg",
          "name": "Airbus",
          "url": "https://www.airbus.com/"
        }
      ]
    },
    {
      "order" : 3,
      "title": "Gold",
      "logos": [
        {
          "order" : 0,
          "logoUrl": "../images/logos/sotec.svg",
          "name": "SOTEC",
          "url": "http://sotec.eu/"
        }
      ]
    },
    {
      "order" : 4,
      "title": "Silver",
      "logos": [
        {
          "order" : 0,
          "logoUrl": "../images/logos/quartett-mobile.svg",
          "name": "Quartett Mobile",
          "url": "https://www.quartett-mobile.de/"
        },
        {
          "order" : 1,
          "logoUrl": "../images/logos/cosmos.svg",
          "name": "Cosmos - Internet of Blockchains",
          "url": "https://cosmos.network/"
        }
      ]
    },
    {
      "order" : 5,
      "title": "Diversity Sponsor",
      "logos": [
        {
          "order" : 0,
          "logoUrl": "../images/logos/flixbus.png",
          "name": "FlixBus",
          "url": "https://flixbus.de"
        }
      ]
    },
    {
      "order" : 6,
      "title": "Supportive Sponsor",
      "logos": [
        {
          "order" : 0,
          "logoUrl": "../images/logos/jetbrains.svg",
          "name": "JetBrains",
          "url": "https://jetbrains.com"
        }
      ]
    }
  ],
  "schedule": {
    "2018-11-10": {
      "dateReadable": "November 10",
      "tracks" : [
        {
          "title" : "Track One"
        },
        {
          "title" : "Track Two"
        },
        {
          "title" : "Workshops"
        }
      ],
      "timeslots": [
        {
          "startTime": "09:00",
          "endTime": "10:00",
          "sessions": [
            { "items": [ "registration" ] }
          ]
        },
        {
          "startTime": "10:00",
          "endTime": "10:20",
          "sessions": [
            { "items": [ "opening" ] }
          ]
        },
        {
          "startTime": "10:20",
          "endTime": "11:00",
          "sessions": [
            { "items": [ "happiness" ] }
          ]
        },
        {
          "startTime": "11:15",
          "endTime": "11:55",
          "sessions": [
            { "items": [ "consolelog" ] }
          ]
        },
        {
          "startTime": "12:10",
          "endTime": "12:35",
          "sessions": [
            { "items": [ "hautecodeture" ] }
          ]
        },
        {
          "startTime": "13:20",
          "endTime": "13:45",
          "sessions": [
            { "items": [ "fatigue" ]},
            { "items": [ "lunch" ]},
            { "items": [ "sketchnoting" ],
              "extend": 3
            }
          ]
        },
        {
          "startTime": "14:00",
          "endTime": "14:40",
          "sessions": [
            { "items": [ "serialweb" ] },
            { "items": [ "lightning-one" ] }
          ]
        },
        {
          "startTime": "15:00",
          "endTime": "15:40",
          "sessions": [
            { "items": [ "bluetooth" ] },
            { "items": [ "quickstartmanagement" ] }
          ]
        },
        {
          "startTime": "15:55",
          "endTime": "16:35",
          "sessions": [
            { "items": [ "a11yfriendlydocs" ] },
            { "items": [ "codeislaw" ] }
          ]
        },
        {
          "startTime": "16:50",
          "endTime": "17:15",
          "sessions": [
            { "items": [ "immersivesound" ] },
            { "items": [ "loveoftech" ] },
            { "items": [ "headlesscms" ],
              "extend": 2
            }
          ]
        },
        {
          "startTime": "17:30",
          "endTime": "18:10",
          "sessions": [
            { "items": [ "codeschools" ] },
            { "items": [ "outofthebox" ] }
          ]
        },
        {
          "startTime": "18:30",
          "endTime": "20:00",
          "sessions": [
            { "items": [ "afterhourstba" ] },
            { "items": [ "driveitlikeyoustoleit" ] }
          ]
        }
      ]
    },
    "2018-11-11": {
      "dateReadable": "November 11",
      "tracks" : [
        {
          "title" : "Track One"
        },
        {
          "title" : "Track Two"
        },
        {
          "title" : "Workshops"
        }
      ],
      "timeslots": [
        {
          "startTime": "09:00",
          "endTime": "09:30",
          "sessions": [
            { "items": [ "registration" ] }
          ]
        },
        {
          "startTime": "09:30",
          "endTime": "10:10",
          "sessions": [
            { "items": [ "featurenotbug" ] },
            { "items": [ "testoftime" ] },
            { "items": [ "actionsongoogle" ],
              "extend": 4
            }
          ]
        },
        {
          "startTime": "10:25",
          "endTime": "10:50",
          "sessions": [
            { "items": [ "zeroadoption" ] },
            { "items": [ "seventeen" ] }
          ]
        },
        {
          "startTime": "11:05",
          "endTime": "11:45",
          "sessions": [
            { "items": [ "gamingthesystem" ] },
            { "items": [ "interviewfromscratch" ] }
          ]
        },
        {
          "startTime": "12:00",
          "endTime": "12:25",
          "sessions": [
            { "items": [ "vrmap" ] },
            { "items": [ "mindfuldesign" ] }
          ]
        },
        {
          "startTime": "12:40",
          "endTime": "13:20",
          "sessions": [
            { "items": [ "livecoding" ] },
            { "items": [ "lunch" ] },
            { "items": [ "lunch" ] }
          ]
        },
        {
          "startTime": "13:35",
          "endTime": "14:15",
          "sessions": [
            { "items": [ "lunch" ] },
            { "items": [ "cssquickdraw" ] },
            { "items": [ "flutter40" ],
              "extend": 1
            }
          ]
        },
        {
          "startTime": "14:30",
          "endTime": "15:10",
          "sessions": [
            { "items": [ "succeedonmobileweb" ] },
            { "items": [ "lightning-two" ] },
            { "items": [ "flutterstudyjam" ],
              "extend": 2
            }
          ]
        },
        {
          "startTime": "15:25",
          "endTime": "15:50",
          "sessions": [
            { "items": [ "webassembly" ] },
            { "items": [ "designdevelopment" ] }
          ]
        },
        {
          "startTime": "16:05",
          "endTime": "16:30",
          "sessions": [
            { "items": [ "brainchemicals" ] },
            { "items": [ "androidautomotive" ] }
          ]
        },
        {
          "startTime": "16:45",
          "endTime": "17:35",
          "sessions": [
            { "items": [ "digitalwellbeing" ] }
          ]
        },
        {
          "startTime": "17:40",
          "endTime": "18:00",
          "sessions": [
            { "items": [ "closing" ] }
          ]
        }
      ]
    }
  },
  "sessions": {
    "registration": {
      "title": "Registration",
      "description": "Welcome to DACHFest! Get your badge, explore the venue, make new friends."
    },
    "opening": {
      "title": "Opening Ceremony",
      "description": ""
    },
    "closing": {
      "title": "Closing Ceremony",
      "description": ""
    },
    "tba": {
      "title": "To be announced!",
      "description": "Surprise! Stay tuned."
    },
    "afterhourstba": {
      "title": "To be announced!",
      "description": "Surprise! Stay tuned.",
      "icon": "party",
      "tags": [ "Afterhours" ]
    },
    "lunch": {
      "title": "Lunch break"
    },
    "driveitlikeyoustoleit": {
      "language": "English",
      "icon": "party",
      "title": "Drive It Like You Stole It! Mario Kart Tournament",
      "description": "Let's have some fun!\n\nAfter Droidcon Berlin, we are bringing the Nintendo Switch Mario Kart tournament to DACHFest as our afterhours entertainment. You don't have to sign up in advance: just bring your Switch with Mario Kart installed—and let's rock! And if you don't have one, come to watch and cheer!",
      "tags": [ "Afterhours" ]
    },
    "lightning-one": {
      "language": "English",
      "title": "⚡ Four En-lightning Talks! ⚡",
      "description": "Everybody Needs Somebody — Mirjam Baüerlein\n\n\"This talk is about how to support people like me: the palm-sweaty, moms-spaghetti scaredy cats that wish they had the courage to meet new people at conferences. Nobody should miss this opportunity. Let’s make tech events more approachable and create good experience for everyone.\"\n\nEver visit a tech event on your own and tried to blend in with the wall, sweaty hands wrapped tightly around your cell phone, internal debating if you just should take a run for the door? Simultaneously hoping to meet new people and dreading someone could talk to you. Ever followed a conference through twitter hashtags, feeling sad, frustrated and angry at yourself that your were too scared to go?\n\nThat’s presumably around 13% of the people you know. People who describe themselves as shy, introverted or socially awkward. You can sum it up with one word: Social anxiety. Broadly speaking that’s the fear of social situations that involve interaction with other people.\n\nIn this talk Mirjam wants to share with you how she tries to be a solution to her own problem. Her project Conference Buddy wants to provide a platform to find companions for tech conferences. Mirjam wants to show you how we can support others to face their fears and give them opportunities to come into company, come to this intimidating, big tech conferences and make successful experiences with this awesome community. Let’s make tech events more approachable - one buddy at a time.\n\n\n\nObservability in the Kitchen — Daisy Tsang\n\nHow can you leverage sensors, open-source software, and Go to improve your kitchen skills? This lightning talk explores the relationship between bread-making, humidity, and temperature, and how one can use inexpensive sensors, Raspberry Pis, and Prometheus to gain insight into the lively world of sourdough cultures.\n\n\n\nDevelopers + Empathy for Users = Win-Win — Wahib Ul Haq\n\n“Ugh, I can’t believe how developers agreed to implement this design. User experience trumps technology.” Wouldn’t it be a win-win if developers care about users as much as designers are held responsible for? This talk is to highlight why it matters, adjusting expectations and areas to focus.\n\nWahib will share his learnings after several years as an Android Dev in product and consulting companies. Highlighting how this mindset of “I’m just a developer” can be toxic and realising that the whole team has (or should have) a common goal of building something that truly delights and adds value to the user. Why developers fail to develop empathy for their users? How “Be proactive, not reactive” approach goes a long way and has the solution to many problems. Close collaboration between Designers and Developers is so underrated and how can it can do wonders for the product.",
      "speakers": [
        "mirjam_diala",
        "1nfoverload",
        "wahibulhaq"
      ],
      "tags": []
    },
    "lightning-two": {
      "language": "English",
      "title": "⚡ It's electric: Four More Lightning Talks! ⚡",
      "description": "Impostor-Driven Development: Impressive but Completely Wrong — Svetlana Sharipova\n\nIt’s 4 am. You are sitting in the screen light focused and horrified. Already burned out, but the adrenaline from deadline keeps you in the dark. Only one night left to learn everything the world knows about programming. Your reputation, job and future are at risk. NO ONE SHOULD KNOW YOU ARE A FRAUD.\n\nThe talk is based on personal experience of being a high performer by exploiting impostor syndrome. While it might be sane in the short term, it leads to anxiety and burnout when used for some period of time. How about using it during 3 years in a corporate culture that doesn’t tolerate failure and open feedback? What if your manager knows how to benefit from your weakness?\n\n\n\nReview Code Like a Bestselling Book — Sarah Köhler\n\n\"Many developers see code reviews as a waste of their time. Is there a way to change their mind? We can improve the code review process so that both author and reviewer profit from it. Based on my experience with proofreading I will tell you how to do better reviews and learn from other’s comments.\"\n\nThis talk will present a collection of tips for developers to make better use of code reviews. Some ideas are targeted at the individual person, but others need to be implemented for the whole team. The tips are inspired by Sarah's experience as a proofreader and the knowledge she gained during her studies in Book Science, where she was able to learn from professional editors and proofreaders. The talk is short and entertaining, but there's going to be at least one small example for each tip to make it easier to understand and apply them later.\n\n\n\nCompassionate Coding: Being Humane in Tech — Sascha Wolf\n\nIn the Tech Industry we value efficiency and productivity. We try to keep our communication concise in an effort to be efficient. But are concise and efficient equivalent when it comes to communication? Or are we forgetting an important variable: humanity?\nOne such strategy is Compassion.\n\nTech is all about writing code, right? It’s about efficient solutions and productive teams. We worship Rockstar Devs, try to be agile and lean, all for the ultimate goal of delivering software faster and better. But are technical solutions all there is to it?\n\nWe will take a critical look at how we communicate in the Tech Industry. We work in teams, collaborate on solutions and gather requirements from the customer. All of which are about communication, about getting information from one head into another head. And of course we try to be as efficient as possible while doing that.\nBy treating communication the same way as we treat tech we ignore a critical variable: humanity. Our colleagues and customers are human, not machines and as such demand different strategies when it comes to the exchange of information.\n\n\n\nTBA\n\nSurprise!",
      "speakers": [
        "sarahkoehler",
        "svetlanasharipova",
        "saschawolf"
      ],
      "tags": []
    },
    "awsnap": {
      "title": "Aw, Snap! Not Open Yet"
    },
    "happiness": {
      "language": "English",
      "title": "Opening Keynote: The Secret Society of Happiness",
      "description": "Happiness and our own search for it have deep impacts on our entire lives. But important as it is, it’s also incredibly complicated. We each carry our own baggage, and the things that make us happy are not constants. However, we can learn so much from each other in a community, and can have a tremendous impact on each other’s happiness - though not always in the most obvious ways.",
      "speakers": [
        "mxsash"
      ],
      "tags": []
    },
    "testoftime": {
      "language": "English",
      "title": "Writing Tests that Stand the Test of Time",
      "description": "One of the promises of test driven development is the confidence and ease with which we can refactor our production code.\n\nHowever, sometimes we find ourselves in a position where our tests are highly coupled to the production code and we have to change the tests every time we update our production code. At this point we start wondering if the tests we had are even worth it if we have to spend so much time to maintain them. If you have ever found yourself having to update your tests every time the behavior of a dependency of the class under test has changed, then this talk is for you.\n\nThis talk is to share with you some patterns, tools and examples that can guide us to write more maintainable tests.",
      "speakers": [
        "segunfamisa"
      ],
      "tags": []
    },
    "fatigue": {
      "language": "English",
      "title": "What Can We Learn With JavaScript Fatigue?",
      "description": "By the time I’m writing this abstract NPM has 568,191 packages. Tomorrow an average of 447 new ones will be published. In this talk, I will not complain about it. Instead, we will study this phenomenon in depth and see what can we learn from JS Fatigue and how to deal with it without headaches.",
      "speakers": [
        "thewizardlucas"
      ],
      "tags": []
    },
    "webassembly": {
      "language": "English",
      "title": "WebAssembly: Binary in Plain English",
      "description": "The beauty of the web is that it works anywhere, no download and no installation. It has come a long way from text pages with links, but the only language that you could use to build applications for it was JavaScript - until now.\n\nThink about cases where you need to use software outside of the browser: video games, 3D rendering, music production and more. These things require a high degree of performance and that’s where WebAssembly steps in - a standardized compilation target for native languages. The support rolled out last year in all major browsers, and there are exciting real-world examples already.\n\nThis will be your gentle guide into what is WebAssembly, why we need it and how you can benefit from it in your next project (even if you continue to work with JavaScript only). The future is here now and it looks fast and bright.",
      "speakers": [
        "milicamihajlija"
      ],
      "tags": []
    },
    "vrmap": {
      "language": "English",
      "title": "VR Map: Using OpenStreetMap Data in WebVR",
      "description": "Do you have to buy proprietary tools as well as data and be an expert programmer to create a virtual world? With a modern browser, Mozilla’s A-Frame library and OpenStreetMap data you don’t: See how Free Software, Open Standards and crowdsourced data let you walk or “fly” through a simple 3D map!",
      "speakers": [
        "robertkaiser"
      ],
      "tags": []
    },
    "serialweb": {
      "language": "English",
      "title": "The Universal Serial Web",
      "description": "As a web developer it's easy to feel intimidated by the world of hardware hacking and the physical web, we have to leave our comfort zone and need to get familiar with a completely new development environment. But not anymore, thanks to wonderful possibilities that the WebUSB Api brings to our browsers.\n\nIn this talk Sebastian will give an intro to the endless wonders we can encounter in the hardware world through our browser windows. Aside from leaerning the basics of USB and serial port communication, we'll paint on USB displays, live tweet to receipt printers, control an Arduino, steal data from Android phones and many more… The only limit is your imagination.",
      "speakers": [
        "asciidisco"
      ],
      "tags": []
    },
    "reviewbook": {
      "language": "English",
      "title": "Review Code Like a Bestselling Book",
      "description": "\"Many developers see code reviews as a waste of their time. Is there a way to change their mind? We can improve the code review process so that both author and reviewer profit from it. Based on my experience with proofreading I will tell you how to do better reviews and learn from other’s comments.\"\n\nThis talk will present a collection of tips for developers to make better use of code reviews. Some ideas are targeted at the individual person, but others need to be implemented for the whole team. The tips are inspired by Sarah's experience as a proofreader and the knowledge she gained during her studies in Book Science, where she was able to learn from professional editors and proofreaders. The talk is short and entertaining, but there's going to be at least one small example for each tip to make it easier to understand and apply them later.",
      "speakers": [
        "sarahkoehler"
      ],
      "tags": []
    },
    "observabilitykitchen": {
      "language": "English",
      "title": "Observability in the Kitchen",
      "description": "How can you leverage sensors, open-source software, and Go to improve your kitchen skills? This lightning talk explores the relationship between bread-making, humidity, and temperature, and how one can use monitoring tools to gain insight into the lively world of sourdough cultures.",
      "speakers": [
        "1nfoverload"
      ],
      "tags": []
    },
    "mindfuldesign": {
      "language": "English",
      "title": "Mindful Design: Designing With Presence for Purpose and Inclusion",
      "description": "Mindfulness is a state of being, an approach to life (and to our work, regardless of its genre) that calls for presence and awareness, care and purpose. Living mindfully, designing mindfully, coding mindfully can be extremely rewarding, for us and for the beneficiaries of our work.\n\nWhile the notion of mindfulness has had a resurgence as a buzz word, its profound and most deep meaning goes beyond light meditation and coloring books. The principles of mindfulness can also be applied to all aspects of our work, especially design work (in the broadest sense of the term, not just in the visual/graphic sense). A mindful approach to design intrinsically implies awareness and the necessary presence to design for inclusivity, accessibility, openness, and ethics, to add value to our daily practice, as well as to our final outcomes: a peaceful and prosperous way to make a difference in our life and in the lives of those who share our path.",
      "speakers": [
        "zetaraffix"
      ],
      "tags": []
    },
    "seventeen": {
      "language": "English",
      "title": "Making a Difference: Experiences of a 17-year-old in the Tech Scene",
      "description": "In this talk, Felix will tell attendees about his background, how he got into programming, and especially how he started contributing to Open Source: from a first Pull Request in the Hacktoberfest to contributing to React, Prettier, and Materialize. Felix will share some of his most inspiring moments in the tech community, but life is not a cinderella story: he will also reveal some of the many challenges he faces because of his age and because he is still going to school.",
      "speakers": [
        "felixwu"
      ],
      "tags": []
    },
    "interviewfromscratch": {
      "language": "English",
      "title": "Interview Process From Scratch",
      "description": "Interviewing potential candidates is hard. It is even harder if you don’t have a proper interviewing process. And even harder if you are not a manager, but a software engineer. You start by using intuition and whatever you think is best. This approach might work, but it is too chaotic and will eventually fail.\n\nInterviewing more than 200 potential candidates in a 5-month period is a lot. You will hear how interview process evolution was made from nothing to the process that works in terms of speed, scale, and quality.\n\nAnd of course, you will learn some useful tips for resume-building and going to interviews, too!",
      "speakers": [
        "sergeykibish"
      ],
      "tags": []
    },
    "impostordriven": {
      "language": "English",
      "title": "Impostor-Driven Development: Impressive but Completely Wrong",
      "description": "It’s 4 am. You are sitting in the screen light focused and horrified. Already burned out, but the adrenaline from deadline keeps you in the dark. Only one night left to learn everything the world knows about programming. Your reputation, job and future are at risk. NO ONE SHOULD KNOW YOU ARE A FRAUD.\n\nThe talk is based on personal experience of being a high performer by exploiting impostor syndrome. While it might be sane in the short term, it leads to anxiety and burnout when used for some period of time. How about using it during 3 years in a corporate culture that doesn’t tolerate failure and open feedback? What if your manager knows how to benefit from your weakness?",
      "speakers": [
        "svetlanasharipova"
      ],
      "tags": []
    },
    "codeislaw": {
      "language": "English",
      "title": "If Code is Law, Who's in Charge of Ethics?",
      "description": "The industrial revolution was a massive movement for research and intellectual progress. Our society is going to its future at lightning speed, sometimes without taking time to think to this future itself. Question isn’t to know if we can get this or that technology available to the masses, but when. In the meantime, the free market pushes our economy to massive consumption of those technologies.\n\nIn 1989, the RFC 1087 was the first to mention digital ethics. 30 years later, what did we do to take care of it? As developers, designers, product managers, UX, etc., we have to protect our users from the free market overflows. That means prevent privacy leaks when users aren’t aware of the power of our apps.",
      "speakers": [
        "m4d_z"
      ],
      "tags": []
    },
    "hautecodeture": {
      "language": "English",
      "title": "Haute Codeture: Clothing as a Canvas",
      "description": "What if, instead going for practicality, we used IoT to create fleeting moments of interaction and beauty? What would happen if others could interact with your clothing via a web app? Stephanie was curious to answer these questions when she tackled her latest hardware project. She’ll share her story of building interactive fashion, the obstacles she's faced as an IoT newbie, and the solutions she's found to overcome them.",
      "speakers": [
        "stephaniecodes"
      ],
      "tags": []
    },
    "gamingthesystem": {
      "language": "English",
      "title": "Gaming the System: Why Messing With Algorithms is Such a Human Hobby",
      "description": "There’s a lot of talk regarding algorithms and how they impact the way we perceive the world. One of the hot topics lately is the fake news and their impact on the American election. Let’s take a look at the other side of things: how some of us actually mess with algorithms for fun or for profit. If you ever wanted to see the human outcomes of some of the math you deal with in your everyday work, this is the talk for you.",
      "speakers": [
        "myriamjessier"
      ],
      "tags": []
    },
    "bluetooth": {
      "language": "English",
      "title": "Fun with Bluetooth",
      "description": "Time for JavaScript to get physical. With WebBluetooth the browser can actually take control of all kinds of physical devices in the real world like lightbulbs, robots and even drones. And nowadays you can even run JavaScript straight on microcontrollers and even little Bluetooth beacons. This talk will teach you the basics that you need to get started and give a peek at some more advanced topics like building your own Bluetooth devices using just JavaScript.",
      "speakers": [
        "html5test"
      ],
      "tags": []
    },
    "loveoftech": {
      "language": "English",
      "title": "For the Love of... Tech!",
      "description": "Hawra is leading a team of female techies stuck in a male-dominant culture, breaking barriers and helping others do the same, and the only connection between them is broken internet and broken Arabic. Her story illustrates exactly this, and how challenges were overcome… for the love of tech.\n\nThis is the story of how a group of women, in a small city, with no opportunity to travel or see people of other cultures and abilities, combined their love for tech, to break the social and cultural barriers that surround them, and created events to share their passion with other women and teach them to aim high and not allow anything to stop them from achieving their dreams.",
      "speakers": [
        "hawramilani"
      ],
      "tags": []
    },
    "everybodyneedssomebody": {
      "language": "English",
      "title": "Everybody Needs Somebody",
      "description": "This talk is about how to support people like me: the palm-sweaty, moms-spaghetti scaredy cats that wish they had the courage to meet new people at conferences. Nobody should miss this opportunity. Let’s make tech events more approachable and create good experience for everyone.\n\nEver visit a tech event on your own and tried to blend in with the wall, sweaty hands wrapped tightly around your cell phone, internal debating if you just should take a run for the door? Simultaneously hoping to meet new people and dreading someone could talk to you. Ever followed a conference through twitter hashtags, feeling sad, frustrated and angry at yourself that your were too scared to go?\n\nThat’s presumably around 13% of the people you know. People who describe themselves as shy, introverted or socially awkward. You can sum it up with one word: Social anxiety. Broadly speaking that’s the fear of social situations that involve interaction with other people.\n\nIn this talk Mirjam wants to share with you how she tries to be a solution to her own problem. Her project Conference Buddy wants to provide a platform to find companions for tech conferences. Mirjam wants to show you how we can support others to face their fears and give them opportunities to come into company, come to this intimidating, big tech conferences and make successful experiences with this awesome community. Let’s make tech events more approachable - one buddy at a time.",
      "speakers": [
        "mirjam_diala"
      ],
      "tags": []
    },
    "developersempathy": {
      "language": "English",
      "title": "Developers + Empathy for Users = Win-Win",
      "description": "“Ugh, I can’t believe how developers agreed to implement this design. User experience trumps technology.” Wouldn’t it be a win-win if developers care about users as much as designers are held responsible for? This talk is to highlight why it matters, adjusting expectations and areas to focus.\n\nWahib will share his learnings after several years as an Android Dev in product and consulting companies. Highlighting how this mindset of “I’m just a developer” can be toxic and realising that the whole team has (or should have) a common goal of building something that truly delights and adds value to the user. Why developers fail to develop empathy for their users? How “Be proactive, not reactive” approach goes a long way and has the solution to many problems. Close collaboration between Designers and Developers is so underrated and how can it can do wonders for the product.",
      "speakers": [
        "wahibulhaq"
      ],
      "tags": []
    },
    "consolelog": {
      "language": "English",
      "title": "console.log(brain)",
      "description": "What is the ultimate hack of our lives? What is the one thing that we strive to learn the most about? What is the thing that will truly unlock our potentials? What if you could log your brain to the developer console, typing with your brain signals?\n\nThis talk is a demonstration of an open-source Brain-Computer Interface that is completely developed with JavaScript, from the ground up, using neural networks and signal processing. Armagan hits the stage with a wireless EEG headset, shows how to read signals from the brain in JavaScript using native C++ Node.js modules over USB, and the implementation in Electron, Node.js and Vue.js.",
      "speakers": [
        "dashersw"
      ],
      "tags": []
    },
    "codeschools": {
      "language": "English",
      "title": "Considering Code Schools: Diversity, Hiring, and What we Might do Differently",
      "description": "Diversity and Inclusion are more than buzzwords - they are part of a greater call-to-action that involves radically re-interpreting the way we train, educate, recruit, hire, and staff teams. We all know that studies show diverse teams and companies are more productive, have less inbuilt bias, and report higher profit margins.\n\nTech education has a key role to play in this re-envisioning of our field. Many opportunities are missed to hire in a diverse way because of institutional bias. A lack of standards is often cited, somewhat defensively, as a reason to not hire school candidates. On the other hand, high-quality graduates fire back that they represent the very diversity tech so desperately needs, but no one is giving them a chance.\n\nCode schools and the tech industry lack perspective on each other. But it doesn’t have to be this way.\n\nA former code school teacher and faculty lead for 3 years, Perry is on a mission to make tech more accessible and inclusive. If you are an engineer, hiring manager, community manager, advocate, or student, he invites you into an exploration of the present and future of tech/ed, the obstacles we face, and what we might change. Together, we’ll explore practical ways everyone, regardless of role, can help build a more diverse, accessible pipeline. You will walk away from this talk ready and equipped to help make a difference - by making tech & tech ed more accessible, more relevant, and more diverse!",
      "speakers": [
        "perrysetgo"
      ],
      "tags": []
    },
    "livecoding": {
      "language": "English",
      "title": "Building a Mentoring Community Through Live Coding",
      "description": "Have you ever wanted to be able to work with a team of developers, sharing your knowledge and learning from those with more experience? Learn about creating a diverse, widespread, encouraging, and productive community through Live Coding!\n\nSince Jesse began live coding in May of 2017, an amazing community of developers of all ages, locations, and skill levels has grown around the live streams. They share ideas, teach and support each other while working on real projects together. Jesse will share his experience and offer some advice on how to create a respectful online environment where everyone is encouraged to ask questions and contribute, and negativity is nearly non-existent.",
      "speakers": [
        "jesserweigel"
      ],
      "tags": []
    },
    "designdevelopment": {
      "language": "English",
      "title": "Bridging the Gap Between Design and Development",
      "description": "Working in interdisciplinary teams is no longer a rarity. In this talk we will cover different ways how design & development can be integrated in product teams, learn from best practices & failures, and see how the role of a UX Engineer helps to bridge the gap between design and development.\n\nUnicorns can’t solve all needs, and they are also quite hard to find. This is where UX Designers and UX Engineers come into play. Don’t miss this talk, as we will learn from concrete do’s and don’ts of how devs and designers can improve their collaboration.",
      "speakers": [
        "lukasziegler"
      ],
      "tags": []
    },
    "brainchemicals": {
      "language": "English",
      "title": "Balancing the Right Brain Chemicals in Your Team",
      "description": "Each one of us flaunts a unique brain wiring. On average, 25% of us are not precisely neurotypical. But what we see as a challenge, can sometimes be our strongest asset. Social anxiety, depression, ADHD, and other non-neurotypical personalities come with unique ways of behaving, responding, and reacting. \n\nIn his experience as a team lead, mentor, and friend, Enrico had the fantastic opportunity to work with different personalities and personalities disorders. As many other team leaders thrown into the profession, through mistakes and errors, he learned how not to push people towards a behavioral culture, but rather to set up the environment around them to be working with all our chemical divergences.\n\nIteration after iteration, when you achieve a balance, magic happens.",
      "speakers": [
        "enricofoschi"
      ],
      "tags": []
    },
    "quickstartmanagement": {
      "language": "English",
      "title": "A Quick Start Guide to Management",
      "description": "Moving from an individual contributor role in technology to managing people or whole teams requires a shift in priorities and new set of skills that we are often poorly prepared for. This talk will look at the core skills a new manager in developer relations will need and look at duties their new role will likely involve. 40 minutes can’t equip you with everything you’ll need to be a great manager, so we’ll be focusing on what you’ll need to know for the first days and weeks as a manager and signpost where you can learn more. Managing people can be an incredibly rewarding, once you’re prepared. Let’s get ready together.",
      "speakers": [
        "jessicarose"
      ],
      "tags": []
    },
    "immersivesound": {
      "language": "English",
      "title": "Hearing the Future: the Past, Present, and Future of Audio Description for the Visually Impaired",
      "description": "Audio description is an established feature for live and audio-visual productions, in which visual information is translated for blind and visually impaired audiences. However, despite being the only method for blind and partially sighted audiences to enjoy visual mediums, current UK laws only require broadcasting companies to make 20% of their content accessible with audio description. This means that the remaining 80% of un-described content, results in visually impaired audiences being segregated from the entertainment that fully sighted individuals can enjoy. But should inclusive entertainment create a barrier or build a bridge towards equality and the future of accessibility?\n\nUsing the opinion of 15 visually impaired participants, “Hearing the Future” explores the diversification of accessibility through audio description in audio-visual mediums. This research delves into how one experimental approach, comprising of 3D immersive audio, sound spatialisation and sound design features, allows blind and visually impaired audiences to not only perceive but experience an accurate interpretation of the optical elements that are presented within visually complex audio visual mediums. This approach created an audio-only experience that could transcend the absence of visual perception.",
      "speakers": [
        "cesarportillo"
      ],
      "tags": []
    },
    "androidautomotive": {
      "language": "English",
      "title": "Android Automotive App Development",
      "description": "What is Android Automotive?\nAndroid Automotive is a part of the publicly released Android Open Source Project. The operating system is designed to run on the infotainment systems of the next car generations. This makes it possible to run the same Android apps that users already know from their smartphone. Additionally the Google Services will be available for developers and users to utilize.\n\nHow does the future of Android Automotive look like?\nVolvo will be the first car manufacturer to use Android Automotive in its vehicles, see news. This includes the integration of the Google Play Store as well as the availability of Google Maps or the Google Assistant directly in the infotainment system. The Google Assistant and its integration with other apps or physical functionalities in the car will be an essential cornerstone of automotive Android.\n\nHow to write Apps for Android Automotive?Writing an app for Android Automotive is quite similar to writing an app for a smartphone. While it is already possible to write apps for Android Auto I would like to explore with the audience what possibilities there are in the future when it comes to writing Android apps for cars. I will go into the details of User Experience design (guidelines, i.e. when it comes to distraction safety), which new interfaces Android Automotive will offer and how to simulate a car on your laptop.",
      "speakers": [
        "henningvonsee"
      ],
      "tags": []
    },
    "featurenotbug": {
      "language": "English",
      "title": "I'm a feature, not a bug!",
      "description": "I’m older, I’m a woman, and I have kids. I also came to tech from the entertainment world.\nThese differences are what helped me craft a unique offering in our app, and speak to it with passion and authority. This is the true story of how the feature was created—and how it recently went viral.\n\nThis experience connected me to a wider world of women in tech who all share a common frustration with health and fitness apps—why are we the afterthought?\n\nThis is also the story of raising up other people, and how we can help fellow employees shine by celebrating who they are, and not forcing them into what looks or sounds right. From hiring people with disabilities to allowing truly flexible work, this is the story of how to attract and retain great people. When you take a chance on differences, the truth is you’re really just filling in gaping holes that exist in your business plan.",
      "speakers": [
        "susiefelber"
      ],
      "tags": []
    },
    "cssquickdraw": {
      "language": "English",
      "title": "CSS QuickDraw",
      "description": "You write performant and clear CSS for your projects. But how well would you do under time pressure? CSS QuickDraw is a realtime multiplayer puzzle game designed to add a spark of interactive entertainment to tech events. Play, cheer, follow the score — CSS selectors have never been more fun!\n\nCSS QuickDraw is a realtime multiplayer puzzle game designed to diversify the format of Web tech events and offer attendees some interactive entertainment. It’s built around a set of CSS selector puzzles, solved by the players in real time over a series of rounds.\n\nPlayers who don’t know the darkest corners of CSS still enjoy participating and learning new things. Experience, while not unimportant, is not crucial to play or to win.\n\nThe game is developed by a not-for-profit collective known as 21/23. Our mission is to explore new forms of teaching and learning and to show just how much fun they can be.",
      "speakers": [
        "alexandergerasimov"
      ],
      "tags": []
    },
    "compassionatecoding": {
      "language": "English",
      "title": "Compassionate Coding - Being Humane in Tech",
      "description": "In the Tech Industry we value efficiency and productivity. We try to keep our communication concise in an effort to be efficient. But are concise and efficient equivalent when it comes to communication? Or are we forgetting an important variable: humanity?\nOne such strategy is Compassion.\n\nTech is all about writing code, right? It’s about efficient solutions and productive teams. We worship Rockstar Devs, try to be agile and lean, all for the ultimate goal of delivering software faster and better. But are technical solutions all there is to it?\n\nWe will take a critical look at how we communicate in the Tech Industry. We work in teams, collaborate on solutions and gather requirements from the customer. All of which are about communication, about getting information from one head into another head. And of course we try to be as efficient as possible while doing that.\nBy treating communication the same way as we treat tech we ignore a critical variable: humanity. Our colleagues and customers are human, not machines and as such demand different strategies when it comes to the exchange of information.",
      "speakers": [
        "saschawolf"
      ],
      "tags": []
    },
    "a11yfriendlydocs": {
      "language": "English",
      "title": "A11y-Friendly Documentation",
      "description": "Accessibility has been finding its stride in the web development community — and it’s not hard to figure out why. According to the World Health Organization, there are over one billion people globally who need an assistive device. With these statistics, organizations and open source projects alike realize that they could be unintentionally locking these people out of their products. As a result, they adjust their developer workflows. And it often ends there, at the product. Documentation is left out of the conversation.\nIf documentation is meant to serve as a tool for learning and comprehension, then it must be included in those conversations. After all, we want to write docs that are truly for everyone — regardless of the technology they use to read it.\n\nIn this talk, we’ll look at how assistive technology consumes documentation and cover some points to consider when building out your docs. Along the way, we’ll touch on quick regulation wins and inclusive writing practices.",
      "speakers": [
        "carolstran"
      ],
      "tags": []
    },
    "succeedonmobileweb": {
      "language": "English",
      "title": "Succeed on Mobile Web: A/B-test, Design and Change",
      "description": "More and more companies are adopting agile approach to building user experience on websites based on A/B-testing methodologies. By using analytical tools developers, UX designers, product teams and marketers are trying to understand what users of mobile website need, what problems they face and how to solve them. They put forward hypotheses, test changes on the site and analyze whether it improves from the user point of view or not. This approach is especially important when it come to designing for mobile web: with the small screen size, it becomes much more difficult to put together functionality, brand attributes, promos, partner material, SEO content and to meet user expectations at the same time. Prioritisation here becomes key and this is where different goals of internal departments may not help the user experience.\n\nIn the short term, the way to increase conversions on mobile web is to study best practices and case studies.\n\nIn the long term, adoption of A/B-testing philosophy within the company leads to building the culture of growth and optimization where everyone is ready to discuss hypotheses, plan experiments, clearly interpret results, be prepared to fail, learn and continue testing on the everyday basis. With the development of Internet commerce this approach became relevant not only to IT companies, but also to absolutely all web players.",
      "speakers": [
        "annapotanina"
      ],
      "tags": []
    },
    "digitalwellbeing": {
      "language": "English",
      "title": "Closing Keynote: How to Have a Better Relationship With the Technology in Your Life",
      "description": "Technology has enhanced billions of lives, but the pervasiveness and utility of modern technology makes increasingly difficult to disconnect. Some people feel driven to be available all of the time, some feel they are wasting their time, and some fear there may social consequences if they step away. Many of us feel frustrated with the very technology we have come to rely on. Bringing technology to everyone comes with the responsibility to understand its impact, ensure it is truly helpful, and that it improves life, not distract from it. We will discuss some research insights that help us understand our frustrations and propose some approaches to think about improving our products, services, and the value they provide.",
      "speakers": [
        "davehogue"
      ],
      "tags": []
    },
    "zeroadoption": {
      "language": "English",
      "title": "Zero Adoption: Lessons Learned From Failing at Open Source",
      "description": "I'd love to tell you a story about how the software I created helped my community. Sadly, I can't: nothing I built ever found an audience. This talk is about how I failed to reach a community, about why it doesn't matter - or rather: what I learned from being stuck in an open source team of one.\n\nFor years I was convinced that the success of an open source project was determined by the usefulness of the software. My imaginary blueprint of open sourcing was:\n1. Build something useful\n2. Open source it\n3. Everybody wins\n\nIt turns out that it is much harder than that. \n\nThis talk is about how I built several tools that would help the UX community to deliver awesome products with a great experience, while never finding an audience for the tools.  We'll look at all the mistakes one can make and what to do instead to build a thriving community. \n\nAnd even if you don't find an audience: Zero adoption does not mean zero value. We'll look at how there is great benefit in building and publishing things, if not for others then for yourselves.",
      "speakers": [
        "bratwurstkomet"
      ],
      "tags": [ ]
    },
    "outofthebox": {
      "language": "English",
      "title": "Designing Socially Acceptable Wearables",
      "description": "Wearing smart glasses, or other wearables with integrated cameras is unwelcome in social situations, as it may cause discomfort and social tension. One reason for this effect is, that bystanders often can’t tell whether the camera is currently on, or off. As LED status lights had been criticized in this context for being not sufficiently understandable, noticeable, secure and trustworthy, we wanted to explore design alternatives other than point light displays. It turned out more difficult than expected: participants in our first co-design sessions often tended to circle around solutions they already knew – in our case status LEDs.\n\nIn my talk, I will share experiences from my life as PhD student and my research on privacy notices for body-worn cameras. As I think participatory design is awesome, and I also love building things, I will show how you can use physical artifacts to make abstract, non-tangible concepts (such as privacy notices) easier to grasp and discuss. You will learn about methods and tools that help to spark creativity and foster out-of-the-box thinking - and why incomplete, not (yet) realizable, exaggerated or visionary ideas are important to keep.",
      "speakers": [
        "marionkoelle"
      ],
      "tags": [ ]
    },
    "flutter40": {
      "language": "English",
      "title": "Flutter in 40 minutes",
      "description": "Flutter’s a new and wonderful way to build apps for iOS and Android. It’s designed to let you create great looking, customized UIs in a surprisingly short amount of time, and have fun while doing it.\n\nWhile we’ll be looking at what makes Flutter tick, this talk will be light on theory and heavy on practice so we can explore Flutter in action. We’re going to dive in to some real Flutter code and build an app because, just like the Matrix, you have to see it for yourself!\n\nSo come take the red pill and experience app development with Flutter.",
      "speakers": [
        "mattsullivan"
      ],
      "tags": [ ]
    },
    "flutterstudyjam": {
      "language": "English",
      "title": "Flutter Study Jam",
      "description": "The Flutter Study Jam is open for beginners and experts. Work together on flutter codelabs, ask questions and get assistance from Matt Sullivan, Lead of Flutter's Developer Relations.",
      "speakers": [
        "mattsullivan"
      ],
      "tags": [ ]
    },
    "actionsongoogle": {
      "language": "English",
      "title": "Creating an Action and helping your local community",
      "description": "There are several ways to support your community using technology, and during this workshop you will learn how to do this building an Action on Google for the Google Assistant. This workshop will cover basics topics about voice applications design, Actions on Google APIs, also some more advanced topics like push notifications, helper intents, and integration with Firebase, and at last, how to publish and promote your Action.",
      "speakers": [
        "netomarin"
      ],
      "tags": [ ]
    },
    "sketchnoting": {
      "language": "English",
      "title": "Sketchnoting & Lettering Workshop",
      "description": "Unleash your creativity while actively listening to talks! Sketchnoting is the art of using visuals to record and share ideas. Come to learn about taking notes, and how to make beautiful sketches with the help of lettering techniques.\n\nTaking notes in a visual way, while actively listening to talks, is an excellent way to remember the most important ideas and going back to them in the future. You can also use sketchnoting to share ideas at work or to organize your day.\nYou will learn sketchnoting techniques from us while making your first sketch! And as well, you will learn the basics of lettering, the art of writing beautiful captions. We will be also sketchnoting with you, sharing our process live!\n\nEveryone can get started with sketchnoting, you only need pen and paper!",
      "speakers": [
        "lariki",
        "miqubel"
      ],
      "tags": [ ]
    },
    "headlesscms": {
      "language": "English",
      "title": "Agile Content Management: The future with Headless CMSs and GraphQL",
      "description": "Our industry is full of new technologies and buzzwords like GraphQL, headless content management, micro-services and serverless. How do you keep track? Where do you learn what it all means? In this talk! We will be combining all of these concepts into a fast-paced 'experience where we explore the changing landscape of working with content on the web, creation and delivery. For those wishing to “code along” a laptop with NodeJS and Chrome will be helpful, but the pace will be fast enough for those just wishing to learn how all these new pieces fit together. Come join us for a flexible, open atmosphere where questions are welcome!\n\nWith experience in branding, web development, product design and digital strategy, Jesse will help explain all these concepts in a clear and helpful way for both coders and the C-suite.",
      "speakers": [
        "jessemartin"
      ],
      "tags": [ ]
    }
  },
  "speakers": {
    "mxsash" : {
      "name" : "Sasha Romijn",
      "country" : "Django // The Netherlands",
      "featured" : true,

      "company" : "Django Software Foundation",
      "title" : "Security Team",

      "photoUrl" : "/images/people/speakers/mxsash.jpg",

      "shortBio" : "Distributor of stroopwafel-based happiness and Python code.",
      "bio" : "Sasha is the co-founder and CTO of a Django development company in Amsterdam. She is deeply involved in the community around Django, a popular Python web framework, being a Django team member, chair of the Dutch Django Association and co-organiser of various conferences. She cares about building communities and conferences in which everyone feels welcome, valued and at home, regardless of their background. Sasha has a specific interest in well-being and ethical issues around communities and development. Some of her side projects are the Less Obvious Conference Checklist, with many less obvious suggestions for event organisers, and Happiness Packets, to spread more gratitude and kindness in open source communities.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/mxsash",
        "name" : "Twitter"
      } ]
    },
    "davehogue": {
      "name": "David Hogue",
      "country": "Google // USA",
      "featured": true,

      "company": "Google",
      "title": "Design Lead, Platforms UX",

      "photoUrl": "/images/people/speakers/davehogue.jpg",

      "shortBio": "Platforms UX Design Lead at Google, focused on the global Android device ecosystem.",
      "bio": "David M. Hogue, Ph.D. is a Design Lead at Google, design strategist, and applied psychologist with 20+ years experience. He combines his design, research, and psychology skills to bring deeper insight into user behavior, guide product strategy and service design systems, and solve challenging UX problems. He is currently focused on the dashboards and tools to monitor, manage, and maintain the global Android device ecosystem. He has consulted with agencies, start-ups, and corporations to help them build stronger design teams through organizational structures, processes, and training. Dave teaches information and interaction courses at San Francisco State University and online with LinkedIn Learning, and he has a special interest in design processes, strategy, and ethics."
    },
    "susiefelber": {
      "name": "Susie Felber",
      "country": "Withings // USA",
      "featured": true,

      "company": "Withings",
      "title": "Global Content Director",

      "photoUrl": "/images/people/speakers/susiefelber.jpg",

      "shortBio": "Writer and comedian, who has written and produced for numerous TV networks and national magazines.",
      "bio": "Susie Felber is a writer and comedian who has written and produced for numerous TV networks including Comedy Central, BBC America, truTV, MTV, ABC, and Lifetime Television. She has written for many national magazines including Cosmopolitan and US Weekly. She has also written, produced and been talent for online, agencies, startups, video games, and radio. She is currently Global Content Director at Withings, a lovely French start-up that was acquired by Nokia, before becoming Withings again. It’s complicated. She’s especially proud of appearing multiple times as a hooker on Conan, writing jokes for Car Talk on NPR, and appearing as the voice of the letter “O” on Sesame Street.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/susiefelber",
        "name" : "Twitter"
      } ]
    },
    "bratwurstkomet": {
      "name": "Memi Beltrame",
      "country": "Less a Mess // Switzerland",
      "featured": true,

      "company": "Less a Mess",
      "title": "Founder, Experience Designer",

      "photoUrl": "/images/people/speakers/bratwurstkomet.jpg",

      "shortBio": "A digital strategist with 20+ years of experience and author of Protostrap, a prototyping framework.",
      "bio": "Memi is a digital strategist with 20+ years of experience in planning and building digital products. He is the author of Protostrap, a prototyping framework for designers, and the founder of Less A Mess, a digital agency that creates enjoyable and meaningful experiences specialising in projects with a high level of complexity. He lives and works in Zurich and is an active member of the local UX and web community.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/bratwurstkomet",
        "name" : "Twitter"
      } ]
    },
    "perrysetgo" : {
      "name" : "Perry Eising",
      "country" : "Netlify // USA",
      "featured" : true,

      "company" : "Netlify",
      "title" : "Community Manager",

      "photoUrl" : "/images/people/speakers/perrysetgo.jpg",

      "shortBio" : "Developer, educator and community organizer on a mission to make tech more inclusive and accessible.",
      "bio" : "Perry (they or he pronouns) is a developer, educator and community organizer on a mission to make tech more inclusive and accessible. After spending equal time working in tech as a front-end and mobile developer, and out of tech in student leadership and academics, Perry realized they could bring both together by teaching tech for a few years as the faculty lead at a code school! No longer a full time teacher, he is still obsessed with facilitating opportunities for learning, growth and improvement, and committed to building strong, diverse communities wherever he goes.<br/><br/>Perry loves laughing out loud, niches, bikes, the outside, quiet time, good talks, and having as much fun as humanly possible.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/perrysetgo",
        "name" : "Twitter"
      } ]
    },
    "stephaniecodes" : {
      "name" : "Stephanie Nemeth",
      "country" : "Microsoft // Germany",
      "featured" : true,

      "company" : "Microsoft",
      "title" : "Software Engineer",

      "photoUrl" : "/images/people/speakers/stephaniecodes.jpg",

      "shortBio" : "Developer at Microsoft and co-organizer of the Stupid Hackathon Amsterdam.",
      "bio" : "Stephanie is a developer living in Berlin. She works at Microsoft and co-organizes the Stupid Hackathon Amsterdam. She enjoys experimenting with hardware and LEDs to make beautiful, useless things.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/stephaniecodes",
        "name" : "Twitter"
      } ]
    },
    "jesserweigel" : {
      "name" : "Jesse R Weigel",
      "country" : "freeCodeCamp // USA",
      "featured" : true,

      "company" : "freeCodeCamp",
      "title" : "",

      "photoUrl" : "/images/people/speakers/jesserweigel.jpg",

      "shortBio" : "Live codes his day-to-day work five days a week for the freeCodeCamp YouTube channel.",
      "bio" : "Jesse live codes his day-to-day work five days a week for the freeCodeCamp YouTube channel. He is currently into building things with React. He loves sharing his coding experiences, including the struggles and failures, with others. He is especially happy when he gets a chance to encourage new developers.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/jesserweigel",
        "name" : "Twitter"
      } ]
    },
    "jessemartin" : {
      "name" : "Jesse Martin",
      "country" : "Germany",
      "featured" : true,

      "company" : "GraphCMS GmbH",
      "title" : "Developer Advocate",

      "photoUrl" : "/images/people/speakers/jessemartin.jpg",

      "shortBio" : "Developer advocate for GraphCMS. Attempting to be the nicest guy on the internet.",
      "bio" : "Jesse Martin is a brand lover, technology champion and all-around nice guy. After years spent in digital strategy and software development, Jesse is on a mission to show developers there is a better way to work with content on the web. When he’s not building databases about wine or comparing deep technical topics to cake layers, he spends his time with his wife and two kids, trying to combine his love for faith, family, friends, fitness and food. He may or may not be in the middle of an 18 hour fast and apologises in advance.",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/motleydev",
        "name" : "Twitter"
      },
        {
        "icon" : "website",
        "link" : "https://graphcms.com",
        "name" : "Website"
      } ]
    },
    "jessicarose" : {
      "name" : "Jessica Rose",
      "country" : "Pursuit Podcast // UK",
      "featured" : true,

      "company" : "",
      "title" : "",

      "photoUrl" : "/images/people/speakers/jesslynnrose.jpg",

      "shortBio" : "Technology’s den mother. More enthusiastic than graceful. Goblin enthusiast.",
      "bio" : "Jessica Rose is a technologist obsessed with fostering more equal access to technical education and meaningful work in technology. She hosts the Pursuit Podcast, co-founded Trans*Code and founded the Open Code meetup series. She is always interested in learning more about what people are working on, come tell her about your projects and/or show her pictures of your pets.",

      "socials" : [
      {
        "icon": "website",
        "link": "http://www.jessica.tech/",
        "name": "Website"
      },
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/jesslynnrose",
        "name" : "Twitter"
      } ]
    },
    "mirjam_diala": {
      "name": "Mirjam Bäuerlein",
      "country": "cosee // Germany",
      "featured": true,

      "company": "cosee",
      "title": "Developer",

      "photoUrl": "/images/people/speakers/mirjam_diala.jpg",

      "shortBio": "A self-taught developer who started programming at the age of eleven on a Schneider CPC 464.",
      "bio": "Mirjam is a self taught frontend developer and scaredy-cat from Germany. At the age of eleven she started programming on her Schneider CPC 464 in Locomotive BASIC. While programming has been a hobby ever since, her career didn’t start in that field at all. She was an accountant, management assistant and office administrator, and later she started to work as a dogtrainer with main focus on behavioral issues. In 2017 Mirjam changed her career for the second time and became a frontend developer.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/mirjam_diala",
        "name" : "Twitter"
      } ]
    },
    "dashersw" : {
      "name" : "Armagan Amcalar",
      "country" : "unu // Germany",
      "featured" : true,

      "company" : "unu",
      "title" : "Head of Software Engineering",

      "photoUrl" : "/images/people/speakers/dashersw.jpg",

      "shortBio" : "Head of Software Engineering at unu GmbH, building the infrastructure for the future of mobility.",
      "bio" : "Armagan is the Head of Software Engineering at <a href='https://unumotors.com/' target='_blank' rel='noopener noreferrer'>unu GmbH</a>, and is currently working on building the infrastructure for the future of mobility.<br/><br/>A software architect well versed in both the backend and frontend systems, he focuses on building resilient clouds. He loves open source and is the author of <a href='https://github.com/dashersw/cote' target='_blank' rel='noopener noreferrer'>cote</a>, a library for building microservices with Node.js, among <a href='https://github.com/dashersw' target='_blank' rel='noopener noreferrer'>many others</a>. In his free time, he loves to hack stuff with JavaScript, ranging from musical gadgets to brain signals processing.<br/><br/>Armagan is a <a href='https://arm.ag/talks' target='_blank' rel='noopener noreferrer'>public speaker</a>, a mentor and a lecturer. He also leads <a href='https://lonca.works' target='_blank' rel='noopener noreferrer'>Lonca</a>, a software craftsmanship school for women engineers, and teaches JavaScript at <a href='http://wtmberlin.com/javascript-crash-course/' target='_blank' rel='noopener noreferrer'>Women Techmakers Berlin</a>.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/dashersw",
        "name" : "Twitter"
      } ]
    },
    "m4d_z" : {
      "name" : "m4dz",
      "country" : "alwaysdata // France",
      "featured" : true,

      "company" : "alwaysdata",
      "title" : "Tech Evangelist",

      "photoUrl" : "/images/people/speakers/m4d_z.jpg",

      "shortBio" : "Tech Evangelist at alwaysdata, concerned about privacy, a respect of private data, and cyber security.",
      "bio" : "m4dz is a strange animal. Through many lives, he always tried to teach to others what he learnt himself. Previously a web developer (nobody’s perfect), concerned about privacy, a respect of private data, and cyber security. He’s now Tech Evangelist at alwaysdata. He tries to inform about present and future of digital issues. His favorite book always remains «Alice in Wonderland».",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/m4d_z",
        "name" : "Twitter"
      } ]
    },
    "carolstran" : {
      "name" : "Carolyn Stransky",
      "country" : "Blacklane // Germany",
      "featured" : true,

      "company" : "Blacklane",
      "title" : "Software Engineer",

      "photoUrl" : "/images/people/speakers/carolstran.jpg",

      "shortBio" : "Carolyn is a Berlin-based frontend developer and former technical writer.",
      "bio" : "Carolyn Stransky is a frontend developer and former technical writer based in Berlin. She currently works at Blacklane and teaches at ReDI School of Digital Integration. You’ll usually find her looking at memes or taking selfies in the nearest restroom.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/carolstran",
        "name" : "Twitter"
      } ]
    },
    "asciidisco" : {
      "name" : "Sebastian Golasch",
      "country" : "Deutsche Telekom // Germany",
      "featured" : true,

      "company" : "Deutsche Telekom",
      "title" : "Specialist Senior Manager Software Developer",

      "photoUrl" : "/images/people/speakers/asciidisco.jpg",

      "shortBio" : "Famous last words: “If I would’ve wanted to work in ‘Enterprise’, I’d have joined Starfleet…”",
      "bio" : "Sebastian Golasch works as a “Specialist Senior Manager Software Developer” at Deutsche Telekom, after some time developing backend applications with Java, PHP and Ruby he became a citizen of the JavaScript world. For the last six years Sebastian tries to improve our lives, working on Deutsche Telekoms Smart Home platform Qivicon. Famous last words: “If I would’ve wanted to work in ‘Enterprise’, I’d have joined Starfleet…”",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/asciidisco",
        "name" : "Twitter"
      } ]
    },
    "myriamjessier" : {
      "name" : "Myriam Jessier",
      "country" : "Canada",
      "featured" : false,
      "company" : "Self-employed Octopus",
      "title" : "Digital Strategist & Technical Marketer",
      "photoUrl" : "/images/people/speakers/myriam-jessier.jpg",
      "shortBio" : "Myriam enjoys long romantic walks to the fridge along with her mini wiener dog.",
      "bio" : "Myriam enjoys long romantic walks to the fridge along with her mini wiener dog. She’s done web things with large international brands, startups and your local Canadian high altitude tree cutter. She specializes in SEO, Digital Analytics and being the one person with the strangest anecdotes. If Myriam was a museum piece - she’d be a T-rex fossil, a book: Aloha from hell, a condiment: wasabi mayonnaise. What Myriam is: a technical marketer with arcane JS knowledge",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/myriamjessier",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "https://www.myriamjessier.com/skills/",
        "name": "Website"
      }]
    },
    "thewizardlucas" : {
      "name" : "Lucas Fernandes da Costa",
      "country" : "Chai.js // UK",
      "featured" : true,

      "company" : "Chai.js",
      "title" : "Maintainer",

      "photoUrl" : "/images/people/speakers/thewizardlucas.jpg",

      "shortBio" : "Core team member of Chai.js and Sinon.js, two of the most popular libraries in the JS ecosystem.",
      "bio" : "Lucas is a Brazilian software engineer living in London. He breathes JavaScript and is passionate about open source. He is a core team member of Chai.js and Sinon.js, two of the most popular libraries in the JS ecosystem, and is always trying to find better and more efficient ways to solve problems. “Strive to be lazy” is his motto.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/thewizardlucas",
        "name" : "Twitter"
      } ]
    },
    "zetaraffix" : {
      "name" : "Raffaella Isidori",
      "country" : "thesign.it // Italy",
      "featured" : true,

      "company" : "thesign.it",
      "title" : "Creative Director",

      "photoUrl" : "/images/people/speakers/zetaraffix.jpg",

      "shortBio" : "A brand and integrated communication designer with over 30 years of experience.",
      "bio" : "Raffaella builds brands, creates communication for businesses around the world, and assists companies in localizing (Ita/Eng) their brands, products, and messages. Besides that, she designs (UX/graphic/visual/digital/print), studies, teaches, takes pictures, writes, translates & coaches professionals on communication and language. Curious as a cat, she collects books, fonts, spices, and essential oils. She lives and works in the countryside (mostly Italian), surrounded by flora & fauna, where she cultivates dreams, and pushes boundaries.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/zetaraffix",
        "name" : "Twitter"
      } ]
    },
    "hawramilani" : {
      "name" : "Hawra Milani",
      "country" : "Code2Serve // UK",
      "featured" : true,

      "company" : "Code2Serve",
      "title" : "Founder",

      "photoUrl" : "/images/people/speakers/hawramilani.jpg",

      "shortBio" : "Founder of Code2Serve, a non-profit organization teaching coding to kids.",
      "bio" : "Hawra is a maker and breaker, who paved her path into tech world through breaking her own and other people’s computers. She’s super passionate about making cool stuff that are usually quite useless once the excitement dies down, and has founded an organisation that teaches children to do the same. She travels the world in hope of meeting women with the same dreams, and inspire them to make these dreams a reality.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/hawramilani",
        "name" : "Twitter"
      } ]
    },
    "lariki": {
      "name": "Lara Martín",
      "country": "Babbel // Germany",
      "featured": true,
      "company": "Babbel",
      "title": "Android Engineer",
      "photoUrl": "/images/people/speakers/lariki.jpg",
      "shortBio": "Lara is a self-made Android developer based in Berlin.",
      "bio": "Lara is a self-made Android developer based in Berlin. Her passion for Android made her transition from her background in science to software development. She’s currently part of the mobile team at Babbel and her dream is to make apps more accessible for everyone. When she’s not attending a tech meetup, you will find her playing videogames.",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/lariki",
        "name" : "Twitter"
      } ]
    },
    "miqubel": {
      "name": "Miquel Beltran",
      "country": "beltran.work // Germany",
      "featured": true,
      "company": "beltran.work",
      "title": "Freelance Android Developer",
      "photoUrl": "/images/people/speakers/miqubel.jpg",
      "shortBio": "Miquel is a Freelance Android developer based in Berlin.",
      "bio": "Miquel is a Freelance Android developer based in Berlin. He is passionate about mobile app development and machine learning, but most importantly, he’s passionate about teaching and learning. Miquel is also an active member of the tech community in Berlin, where he has conducted workshops and talks. He helps running a local meetup group where they teach development to beginners and underrepresented communities in tech.",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/miqubel",
        "name" : "Twitter"
      } ]
    },
    "annapotanina" : {
      "name" : "Anna Potanina",
      "country" : "Google // Ireland",
      "featured" : true,

      "company" : "Google",
      "title" : "UX & CRO Consultant",

      "photoUrl" : "/images/people/speakers/annapotanina.jpg",

      "shortBio" : "Anna is an UX & CRO Expert, illustrator, VR enthusiast, and a global citizen.",
      "bio" : "Anna Potanina is a mobile UX & CRO consultant at Google and in her free time an illustrator and VR enthusiast. She is an expert in User Experience, Design and Conversion Optimisation and a passionate advocate of combining creative thinking and data to help businesses succeed on mobile. Anna helps Google partners across EMEA improve their mobile experiences by leading design sprints, webinars and UX workshops. Prior to Google she was an IT consultant at Accenture. She has degrees in Applied Informatics, Innovations Technology Management and CEMS International Management. Anna lived in Russia, Austria, UK and now she is based in Google European Headquarters in sunny Dublin (yes it is sunny).",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/derivaatta",
        "name" : "Twitter"
      },
      {
        "icon": "facebook",
        "link": "https://www.facebook.com/annapotaninaart/",
        "name": "Facebook"
      },
      {
        "icon": "linkedin",
        "link": "https://www.linkedin.com/in/annapotanina/",
        "name": "LinkedIn"
      } ]
    },
    "html5test": {
      "name": "Niels Leenheer",
      "country": "HTML5test // The Netherlands",
      "featured": true,

      "company": "HTML5test",
      "title": "Founder",

      "photoUrl": "/images/people/speakers/html5test.jpg",

      "shortBio": "Niels is the creator of HTML5test.com and runs one of the largest Open Device Labs in the world.",
      "bio": "Niels is a self-professed browser geek. He has been hooked on browsers ever since somebody showed him the original Nexus browser on a NeXT Cube back in the dark ages of the internet. Niels is the creator of HTML5test.com and runs one of the largest Open Device Labs in the world. He loves procrastinating, collecting weird devices with even stranger browsers, drawing pixel art monsters, procrastinating, researching obscure browsers and tinkering with hardware. For his day job he is CTO of Salonhub and creates web applications for hair salons.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/html5test",
        "name" : "Twitter"
      } ]
    },
    "enricofoschi": {
      "name": "Enrico Foschi",
      "country": "ZAGENO // Germany",
      "featured": true,

      "company": "ZAGENO",
      "title": "VP of Technology",

      "photoUrl": "/images/people/speakers/enricofoschi.jpg",

      "shortBio": "Enrico is a hands-on tech lead with more than 13 years experience in growing teams with a focus on startups.",
      "bio": "Enrico is a hands-on tech lead with more than 13 years experience in growing teams in small and large environments, with a focus on startups and fast-growing businesses. In his last and present job, he built, leads and mentors a fantastic tech team at ZAGENO, a biotech marketplace located in Boston (MA) and Berlin (Germany). When he isn’t driving ZAGENO’s tech, Enrico spends time playing the piano, kayaking in the Brandenburg region or, with his wife, tasting and testing the many restaurants and bars in Berlin.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/enricofoschi",
        "name" : "Twitter"
      } ]
    },
    "segunfamisa" : {
      "name" : "Segun Famisa",
      "country" : "Trivago // Germany",
      "featured" : true,

      "company" : "Trivago",
      "title" : "Software Engineer",

      "photoUrl" : "/images/people/speakers/segunfamisa.jpg",

      "shortBio" : "Segun is a Google Developer Expert for Android, passionate about travel, food and everything in-between.",
      "bio" : "Segun Famisa is a Software Engineer at trivago based in Düsseldorf, Germany. He has previously worked at Andela as an Android Consultant in Lagos, Nigeria where he worked with various partners on their Android projects. He also worked at Konga where he led Android development efforts on the KongaPay team. He is passionate about Software Development and loves to share his passion and findings through technical articles on his blog as well as speaking about the platform. He likes to do some painting in his spare time.",

      "socials" : [
      {
        "icon": "website",
        "link": "https://www.segunfamisa.com",
        "name": "Website"
      },
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/segunfamisa",
        "name" : "Twitter"
      } ]
    },
    "sergeykibish" : {
      "name" : "Sergey Kibish",
      "country" : "Latvia",
      "featured" : true,

      "company" : "",
      "title" : "Software Engineer",

      "photoUrl" : "/images/people/speakers/sergeykibish.jpg",

      "shortBio" : "Software Engineer, community organizer, music enthusiast. Full of passion and charisma.",
      "bio" : "Sergey is a Software Engineer and GDG Riga organiser. Have hands-on experience with different technologies. Can’t sit still and don’t do something for a long time. When there is a spare time - do something musical. Don’t be afraid to ask questions.",

      "socials" : [
      {
        "icon": "website",
        "link": "https://sergeykibish.com/",
        "name": "Website"
      },
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/s_kibish",
        "name" : "Twitter"
      } ]
    },
    "cesarportillo" : {
      "name" : "Cesar Portillo",
      "country" : "SAE Institute // United Kingdom",
      "featured" : true,

      "company" : "SAE Institute London",
      "title" : "Sound Artist & Engineer",

      "photoUrl" : "/images/people/speakers/cesarportillo.jpg",

      "shortBio" : "Sound Engineer & Researcher, making audio-visual mediums immersive & accessible to Blind and Partially sighted audiences.",
      "bio" : "Cesar Portillo is a sound artist and engineer with a background in post production. After graduating from Middlesex University, with a degree in sound engineering, Cesar is now innovating and implementing 3D immersive sound features through international, award-winning film productions. Sound not only feeds our hearing and imagination but, through Cesar’s innovations in sound design, he provides the option for blind and visually impaired audiences to fully immersive themselves in visual stories; transcending the current limitations of audio description. His recent work embraces inclusive sound design approaches using sound spatialisation, auditory perception analysis and sound effects as a language to make visual stories accessible and experiential for all audiences.",

      "socials" : [
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/c_portillo_",
        "name" : "Twitter"
      } ]
    },
    "milicamihajlija" : {
      "name" : "Milica Mihajlija",
      "country" : "Serbia",
      "featured" : false,

      "company" : "",
      "title" : "Web Developer",

      "photoUrl" : "/images/people/speakers/milica.jpg",

      "shortBio" : "Web Developer in love with all things internet and browser related.",
      "bio" : "Milica is a web developer from Belgrade in love with all things internet. She got interested in how browsers work while interning at Mozilla on Servo engine and is currently working with Chrome team on educating developers about performance optimizations and best practices. When she’s not nerding out, she’s doing yoga, practicing pirouettes or engineering sandwiches.",
      "socials" : [
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/bibydigital",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "https://mihajlija.github.io/",
        "name": "Website"
      }]
    },
    "saschawolf" : {
      "name" : "Sascha Wolf",
      "country" : "grandcentrix // Germany",
      "featured" : true,
      "company" : "grandcentrix",
      "title" : "Software Engineer",
      "photoUrl" : "/images/people/speakers/saschawolf.jpg",
      "shortBio" : "Compassionate problem solver, loving husband, father and avid roleplayer.",
      "bio" : "Sascha is a 28-year-old Software Developer from Cologne, Germany. He used to do full-stack iOS and web development but today focusses on building scalable, resilient, distributed backend systems at grandcentrix, germany’s leading system integrator for IoT solutions. Communication, compassion, and knowledge-sharing are all important topics for him, and he likes to think about how we can use them to build a better and more productive place to work. In his free-time he is a loving husband, father and avid roleplayer. He reads a lot, loves a good science fiction movie and likes to engage in thought-provoking conversations from game design to system architecture or the meaning of life.",
      "socials" : [{
        "icon" : "twitter",
        "link" : "https://twitter.com/ZeekerDev",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "https://stackoverflow.com/users/2274224/sascha-wolf?tab=profile",
        "name": "Website"
      }]
    },
    "alexandergerasimov" : {
      "name" : "Alexander Gerasimov",
      "country" : "21/23 // Germany",
      "featured" : true,

      "company" : "21/23",
      "title" : "Front-End Software Engineer",

      "photoUrl" : "/images/people/speakers/alexandergerasimov.jpg",

      "shortBio" : "Alex builds crazy over-engineered stuff, teaches JavaScript or Haskell, and gamifies tech education with his friends at 21/23.",
      "bio" : "Alex is a front-end engineer in the office hours and a functional programming aficionado in his spare time. In in attempt to balance his job, community work, building crazy over-engineered stuff, teaching JavaScript or Haskell and gamifying tech education with his friends at 21/23 Alex does his best to stay sane. Admires passionate people, always happy to share ideas, loves learning languages, has mixed feelings about One Direction.",
      "socials" : [
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/da_quirm",
        "name" : "Twitter"
      },
      {
        "icon": "github",
        "link": "https://github.com/21-23",
        "name": "Github"
      } ]
    },
    "lukasziegler" : {
      "name" : "Lukas Ziegler",
      "country" : "Austria",
      "featured" : false,

      "company" : "",
      "title" : "UX Engineer",

      "photoUrl" : "/images/people/speakers/lukasziegler.jpg",

      "shortBio" : "Half techie, half visual thinker. Lukas feels most comfortable at the intersection of design and development.",
      "bio" : "Half techie, half visual thinker. Lukas feels most comfortable at the intersection of design and development. Having studied at both TU Munich and LMU Munich, he's got to see the best of “both worlds” already during his studies. Following this approach, he's worked as a software engineer at Red Bull Media House for a few years and is now working in their UX Design Team, where he again have got the opportunity to combine the best of both worlds. What motivates Lukas is the vision to develop new and meaningful products, to work in teams that outgrow their own capabilities, and to work on meaningful products that actually solve users’ needs.",
      "socials" : [
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/ZieglerLukas",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "https://lukasziegler.com/",
        "name": "Website"
      }]
    },
    "felixwu" : {
      "name" : "Felix Wu",
      "country" : "TNG // Germany",
      "featured" : true,

      "company" : "TNG Technology Consulting",
      "title" : "Software Engineer",

      "photoUrl" : "/images/people/speakers/felixwu.jpg",

      "shortBio" : "Felix is a German high school student with a keen interest in Computer Science, Physics, Math and Open Source.",
      "bio" : "Felix is a 17 y/o Software Engineer from Germany. Besides school, he helps companies all around the world building their technical infrastructure as a part-time Frontend Consultant for TNG Technology Consulting. In his free time, he is an active Open Source contributor and the co-creator of the JavaScript snippet collection 30-seconds-of-code and a platform for tech interviewees called 30-seconds-of-interviews. He currently also maintains react-perf-devtool. When not coding, you can find him talking or reading about it, as well as advocating for Youth in Tech and organizing CSSFrankfurt. He also loves travelling, especially with his girlfriend, and playing basketball and frisbee, as well as hanging out with friends. Like many young people, he also loves going on parties! So far, he has done mostly JavaScript stuff at Runtastic, GEZE and TNG Technology Consulting.",
      "socials" : [
      {
        "icon" : "twitter",
        "link" : "https://twitter.com/flxwu",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "https://flxwu.com/",
        "name": "Website"
      }]
    },
    "svetlanasharipova" : {
      "name" : "Svetlana Sharipova",
      "country" : "Russia",
      "featured" : false,
      "company" : "Independent",
      "title" : "Frontend developer",
      "photoUrl" : "/images/people/speakers/SvetlanaSharipova.jpg",
      "shortBio" : "Self-taught frontend developer with a passion for cats, gifs and accessible interfaces.",
      "bio" : "At the age of 9 Svetlana made her first webpage about cats (lots of cats and sparkling gifs). Then she lost her direction until 4 years ago. Unable to resist cat gifs influence she found her passion in building accessible interfaces for everyone. By day she works as a frontend developer contractor, by night she sleeps. In spare time she mentors junior developers, travels, dreams and occasionally gives talks on frontend related topics and about mental health.",
      "socials" : [{
        "icon" : "twitter",
        "link" : "https://twitter.com/helloDeadline",
        "name" : "Twitter"
      }]
    },
    "1nfoverload": {
      "name" : "Daisy Tsang",
      "country" : "Germany",
      "featured" : false,
      "company" : "",
      "title" : "",
      "photoUrl" : "/images/people/speakers/1nfoverload.jpg",
      "shortBio" : "Programmer, Writer, Tinkerer, Language Enthusiast, Baker, Knitter.",
      "bio" : "Programmer, Writer, Tinkerer, Language Enthusiast, Baker, Knitter.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/1nfoverload",
        "name" : "Twitter"
      } ]
    },
    "robertkaiser" : {
      "name" : "Robert Kaiser",
      "country" : "KaiRo.at // Austria",
      "featured" : true,
      "company" : "KaiRo.at",
      "title" : "",
      "photoUrl" : "/images/people/speakers/kairo.jpg",
      "shortBio" : "Robert Kaiser (“KaiRo”) is a Mozilla Tech Speaker, OpenStreetMap contributor, and freelance Web/Linux expert.",
      "bio" : "Robert Kaiser (“KaiRo”) is a Mozilla Tech Speaker, OpenStreetMap contributor, and freelance Web/Linux expert. Close to 20 years in the Mozilla community have given him a lot of insight into the Web’s technologies and history. He likes to try out alternative solutions that increase user freedom and privacy, and take a peek into new technology. On/under his desk, at least 5 devices with a Linux kernel run on a normal day and communicate with other Linux systems he’s administrating. KaiRo is a burning supporter of Mozilla’s Mission and Manifesto as well as Star Trek’s vision of a diverse society in a positive future. For taking a break from technology, he likes to go for singing karaoke and writing his own songs.",
      "socials" : [{
        "icon" : "website",
        "link" : "https://home.kairo.at/blog/",
        "name" : "Website"
      }]
    },
    "henningvonsee": {
      "name" : "Henning von See",
      "country" : "Google // Germany",
      "featured" : true,
      "company" : "Google",
      "title" : "Partner Engineer",
      "photoUrl" : "/images/people/speakers/henningvonsee.jpg",
      "shortBio" : "Engineer at the Google's Android Automotive Team in Munich.",
      "bio" : "Before joining his current team, Henning worked as a project lead for BMW Connected Drive. Since April, he is a Partner Engineer in the Android Automotive Team in Munich.",
      "socials" : []
    },
    "marionkoelle": {
      "name" : "Marion Koelle",
      "country" : "University of Oldenburg // Germany",
      "featured" : true,
      "company" : "University of Oldenburg",
      "title" : "Research Associate/PhD Student",
      "photoUrl" : "/images/people/speakers/marionkoelle.jpg",
      "shortBio" : "PhD student researching socially acceptable interfaces and emerging tech, hacker, sportive and creative.",
      "bio" : "Marion Koelle has a passion for Human-Computer Interaction (HCI) research and for teaching elements of design thinking and various design methods to engineering students. As a research fellow and PhD student at the University of Oldenburg (Germany) she researches the social acceptability of emerging technologies, and how to design socially acceptable interfaces. In her free time, she enjoys outdoor sports, including running, cycling, mountaineering, and skiing. On rainy days, she explores 3D printing, hardware hacking, and sketching.",
      "socials" : [{
        "icon" : "twitter",
        "link" : "https://twitter.com/marionkoellehci",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "http://www.marionkoelle.de/",
        "name": "Website"
      }]
    },
    "mattsullivan": {
      "name" : "Matt Sullivan",
      "country" : "Google // USA",
      "featured" : true,
      "company" : "Google",
      "title" : "Flutter Developer Relations Lead",
      "photoUrl" : "/images/people/speakers/mattsullivan.jpg",
      "shortBio" : "Flutter's developer relations lead, usually wearing too many fitness devices in the gym.",
      "bio" : "Matt leads Flutter's developer relations from Google’s Mountain View campus. He joined the Flutter team last year, having spent three years working on Android, Wear OS and Google Fit. Before Google, Matt worked in a diverse range of fields, from bioinformatics to digital cinema, and holds a Ph.D. in Electrical Engineering. When he’s not hacking on Flutter, you’ll probably find him in the gym wearing far too many fitness sensors.",
      "socials" : [{
        "icon" : "twitter",
        "link" : "https://twitter.com/mjohnsullivan",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "http://flutter.io",
        "name": "Website"
      }]
    },
    "netomarin": {
      "name" : "Neto Marin",
      "country" : "Google // USA",
      "featured" : true,
      "company" : "Google",
      "title" : "Actions on Google Developer Advocate",
      "photoUrl" : "/images/people/speakers/netomarin.jpg",
      "shortBio" : "Actions on Google DevRel. But first of all a passionate and dedicated dad and husband!",
      "bio" : "Actions on Google DevRel, aiming to help developers to create awesome Actions for Google Assistant. But first of all a passionate and dedicated dad and husband!",
      "socials" : [{
        "icon" : "twitter",
        "link" : "https://twitter.com/netomarin",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "http://netomarin.io/",
        "name": "Website"
      }]
    },
    "sarahkoehler" : {
      "name" : "Sarah Köhler",
      "country" : "Searchmetrics // Germany",
      "featured" : true,
      "company" : "Searchmetrics GmbH",
      "title" : "Frontend Engineer",
      "photoUrl" : "/images/people/speakers/sarahkoehler.jpg",
      "shortBio" : "Book Lover turned developer, likes to share knowledge which is mostly javascript and react related.",
      "bio" : "After a detour into the world of books an publishers Sarah decided to pursue a degree in Computer Science and become a developer.\n\nSarah spends most of her time with Javascript and React, but likes to devote some time to her secret passion, Golang. She is one of the hosts of the biweekly Hack Nights of Women Who Code Berlin. She usually has great plans for personal projects but most of time ends up happily sharing her knowledge and mentoring beginners.\n\nIf she is not in front of a screen she tries to undo the damage of too much sitting or tries new cooking recipes.",
      "socials" : [
        {
          "icon": "linkedin",
          "link": "https://www.linkedin.com/in/sarah-k%C3%B6hler-152665127/",
          "name": "LinkedIn"
        }]
    },
    "wahibulhaq" : {
      "name" : "Wahib Ul Haq",
      "country" : "KI Labs // Germany",
      "featured" : false,
      "company" : "KI Labs",
      "title" : "Android Developer",
      "photoUrl" : "/images/people/speakers/wahibulhaq.jpg",
      "shortBio" : "Android Developer at KI Labs, Lazy Storyteller. 🇵🇰 expat in 🇩🇪. ",
      "bio" : "Android Developer and other stuff at KI labs. Takes keen interest in more than just the coding side of an app. Got a thing for Product, Engineering, People & Sarcasm. Lazy Storyteller. 🇵🇰 expat in 🇩🇪.",
      "socials" : [{
        "icon" : "twitter",
        "link" : "https://twitter.com/wahibhaq",
        "name" : "Twitter"
      },
      {
        "icon": "website",
        "link": "http://wahibhaq.com",
        "name": "Website"
      }]
    }
  },
  "team": [
    {
      "members": [
        {
          "name": "Ed Medvedev",
          "photoUrl": "/images/people/eduard_medvedev.jpg",
          "socials": [
            {
              "icon": "twitter",
              "link": "https://twitter.com/ohaithear",
              "name": "Twitter"
            },
            {
              "icon": "github",
              "link": "github.com/emedvedev",
              "name": "Github"
            }
          ],
          "title": "WTM Berlin"
        },
        {
          "name": "Benjamin Stürmer",
          "photoUrl": "/images/people/benjamin_stuermer.jpg",
          "socials": [
            {
              "icon": "gplus",
              "link": "https://plus.google.com/+BenjaminStürmer",
              "name": "Google+"
            },
            {
              "icon": "facebook",
              "link": "https://www.facebook.com/benjamin.stuermer",
              "name": "Facebook"
            },
            {
              "icon": "twitter",
              "link": "https://twitter.com/BenjaminStrmer",
              "name": "Twitter"
            },
            {
              "icon": "website",
              "link": "https://www.stuermer-benjamin.de",
              "name": "Website"
            },
            {
              "icon": "linkedin",
              "link": "https://www.linkedin.com/in/stuermer-benjamin",
              "name": "LinkedIn"
            }
          ],
          "title": "GDG Munich Android"
        },
        {
          "name": "Helmuth Breitenfellner",
          "title": "GDG Vienna"
        },
        {
          "name": "Angelo Rüggeberg",
          "title": "GDG Munich"
        },
        {
          "name": "Hasan Hosgel",
          "title": "GDG Berlin Android"
        },
        {
          "name": "Ramon Huidobro",
          "title": "WTM Vienna"
        },
        {
          "name": "Pilar Huidobro",
          "title": "WTM Vienna"
        },
        {
          "name": "Antonio Roa-Valverde",
          "title": "GDG Innsbruck"
        },
        {
          "name": "Tarik Huber",
          "title": "GDG Berchtesgadener Land"
        },
        {
          "name": "Marc Edem",
          "title": "GDG Vienna"
        },
        {
          "name": "Madlaina Kalunder",
          "photoUrl": "/images/people/madlaina_kalunder.jpg",
          "socials": [
            {
              "icon": "twitter",
              "link": "https://twitter.com/anialdam",
              "name": "Twitter"
            },
            {
              "icon": "github",
              "link": "https://github.com/aadjou",
              "name": "Github"
            },
            {
              "icon": "linkedin",
              "link": "https://www.linkedin.com/in/madlaina-kalunder/",
              "name": "LinkedIn"
            }
          ],
          "title": "WTM Switzerland"
        },
        {
          "name": "Mario Fahlandt",
          "title": "GDG Cloud Munich"
        },
        {
          "name": "Jossi Wolf",
          "title": "GDG Hamburg Android"
        },
        {
          "name": "Timea Turdean",
          "photoUrl": "/images/people/timea_turdean.jpg",
          "socials": [
            {
              "icon": "twitter",
              "link": "https://twitter.com/timeaturdean",
              "name": "Twitter"
            },
            {
              "icon": "linkedin",
              "link": "https://www.linkedin.com/in/timeaturdean/",
              "name": "LinkedIn"
            }
          ],
          "title": "WTM Vienna"
        },
        {
          "name": "Wolfram Rittmeyer",
          "title": "GDG Düsseldorf"
        },
        {
          "name": "Ann-Katrin Borgenstam",
          "socials": [
            {
              "icon": "twitter",
              "link": "https://twitter.com/AKNextChapter",
              "name": "Twitter"
            }
          ],
          "title": "GDG/WTM Düsseldorf"
        },
        {
          "name": "Raphael Miranda",
          "photoUrl": "/images/people/raphael_miranda.jpg",
          "socials": [
            {
              "icon": "twitter",
              "link": "https://twitter.com/rafael_cm",
              "name": "Twitter"
            },
            {
              "icon": "linkedin",
              "link": "https://www.linkedin.com/in/rafael-cm-miranda/",
              "name": "LinkedIn"
            },
            {
              "icon": "github",
              "link": "https://github.com/raeglan",
              "name": "Github"
            }
          ],
          "title": "GDG Bremen"
        }
      ],
      "title": ""
    }
  ],
  "tickets": [
    {
      "available" : true,
      "primary" : true,
      "regular" : true,
      "currency" : "€",
      "info" : "A ticket: you buy it and attend the conference. It's really that simple!",
      "name" : "Standard",
      "price" : 120,
      "soldOut" : false,
      "url" : "https://ti.to/dachfest/2018"
    },
    {
      "available" : true,
      "currency" : "€",
      "info" : "If your employer doesn't cover the ticket cost, here's a discount for you.",
      "name" : "Self-funded",
      "price" : 70,
      "soldOut" : false,
      "url" : "https://ti.to/dachfest/2018"
    },
    {
      "available" : true,
      "currency" : "€",
      "info" : "Being a student is hard, so let us make it a bit easier. ❤️",
      "name" : "Student",
      "price" : 50,
      "soldOut" : false,
      "url" : "https://ti.to/dachfest/2018"
    },
    {
      "available" : true,
      "currency" : "€",
      "info" : "Free admission to the conference for TU Members. ❤️",
      "name" : "TU Student / Member",
      "price" : 0,
      "soldOut" : false,
      "url" : "https://ti.to/dachfest/2018"
    }
   ],
  "triggers": {
    "images": false
  },
  "videos": [ ],
  "previousSpeakers": { }
}
